<abi-corpus architecture='elf-amd-x86_64' soname='liburcu-signal.so.6'>
  <elf-needed>
    <dependency name='liburcu-common.so.6'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <!-- call_rcu_after_fork_child_sig -->
    <elf-symbol name='call_rcu_after_fork_child_sig' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- call_rcu_after_fork_parent_sig -->
    <elf-symbol name='call_rcu_after_fork_parent_sig' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- call_rcu_before_fork_sig -->
    <elf-symbol name='call_rcu_before_fork_sig' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- call_rcu_data_free_sig -->
    <elf-symbol name='call_rcu_data_free_sig' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- call_rcu_sig -->
    <elf-symbol name='call_rcu_sig' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- compat_futex_async -->
    <elf-symbol name='compat_futex_async' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- compat_futex_noasync -->

    <!-- rcu_barrier_sig -->
    <elf-symbol name='rcu_barrier_sig' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_cmpxchg_pointer_sym -->
    <elf-symbol name='rcu_cmpxchg_pointer_sym' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_defer_barrier_sig -->
    <elf-symbol name='rcu_defer_barrier_sig' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_defer_barrier_thread_sig -->
    <elf-symbol name='rcu_defer_barrier_thread_sig' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_defer_exit_sig -->
    <elf-symbol name='rcu_defer_exit_sig' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_defer_register_thread_sig -->
    <elf-symbol name='rcu_defer_register_thread_sig' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_defer_unregister_thread_sig -->
    <elf-symbol name='rcu_defer_unregister_thread_sig' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_dereference_sym -->
    <elf-symbol name='rcu_dereference_sym' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_exit_sig -->
    <elf-symbol name='rcu_exit_sig' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_init_sig -->
    <elf-symbol name='rcu_init_sig' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_read_lock_sig -->
    <elf-symbol name='rcu_read_lock_sig' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_read_ongoing_sig -->
    <elf-symbol name='rcu_read_ongoing_sig' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_read_unlock_sig -->
    <elf-symbol name='rcu_read_unlock_sig' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_register_thread_sig -->
    <elf-symbol name='rcu_register_thread_sig' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_set_pointer_sym -->
    <elf-symbol name='rcu_set_pointer_sym' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_unregister_thread_sig -->
    <elf-symbol name='rcu_unregister_thread_sig' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_xchg_pointer_sym -->
    <elf-symbol name='rcu_xchg_pointer_sym' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- set_cpu_call_rcu_data_sig -->
    <elf-symbol name='set_cpu_call_rcu_data_sig' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- set_thread_call_rcu_data_sig -->
    <elf-symbol name='set_thread_call_rcu_data_sig' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- synchronize_rcu_sig -->
    <elf-symbol name='synchronize_rcu_sig' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- urcu_register_rculfhash_atfork_sig -->
    <elf-symbol name='urcu_register_rculfhash_atfork_sig' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- urcu_unregister_rculfhash_atfork_sig -->
    <elf-symbol name='urcu_unregister_rculfhash_atfork_sig' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <!-- __urcu_compat_futex_cond -->
    <elf-symbol name='__urcu_compat_futex_cond' size='48' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- __urcu_compat_futex_lock -->
    <elf-symbol name='__urcu_compat_futex_lock' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_flavor_sig -->
    <elf-symbol name='rcu_flavor_sig' size='112' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_gp_sig -->
    <elf-symbol name='rcu_gp_sig' size='128' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_reader_sig -->
    <elf-symbol name='rcu_reader_sig' size='256' type='tls-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='urcu.c' comp-dir-path='src' language='LANG_C99'>

    <!-- char -->
    <type-decl name='char' size-in-bits='8' id='type-id-1'/>
    <!-- char[40] -->
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='320' id='type-id-2'>
      <!-- <anonymous range>[40] -->
      <subrange length='40' type-id='type-id-3' id='type-id-4'/>

    </array-type-def>
    <!-- int -->
    <type-decl name='int' size-in-bits='32' id='type-id-5'/>
    <!-- long int -->
    <type-decl name='long int' size-in-bits='64' id='type-id-6'/>
    <!-- short int -->
    <type-decl name='short int' size-in-bits='16' id='type-id-7'/>
    <!-- unsigned int -->
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-8'/>
    <!-- unsigned long int -->
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-3'/>
    <!-- void -->
    <type-decl name='void' id='type-id-9'/>
    <!-- struct rcu_gp_sig -->
    <class-decl name='rcu_gp_sig' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../include/urcu/static/urcu.h' line='119' column='1' id='type-id-10'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned long int rcu_gp_sig::ctr -->
        <var-decl name='ctr' type-id='type-id-3' visibility='default' filepath='../include/urcu/static/urcu.h' line='127' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int32_t rcu_gp_sig::futex -->
        <var-decl name='futex' type-id='type-id-11' visibility='default' filepath='../include/urcu/static/urcu.h' line='129' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef __int32_t int32_t -->
    <typedef-decl name='int32_t' type-id='type-id-12' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-11'/>
    <!-- typedef int __int32_t -->
    <typedef-decl name='__int32_t' type-id='type-id-5' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-12'/>
    <!-- struct rcu_reader_sig -->
    <class-decl name='rcu_reader_sig' size-in-bits='2048' is-struct='yes' visibility='default' filepath='../include/urcu/static/urcu.h' line='134' column='1' id='type-id-13'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned long int rcu_reader_sig::ctr -->
        <var-decl name='ctr' type-id='type-id-3' visibility='default' filepath='../include/urcu/static/urcu.h' line='136' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- char rcu_reader_sig::need_mb -->
        <var-decl name='need_mb' type-id='type-id-1' visibility='default' filepath='../include/urcu/static/urcu.h' line='137' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- cds_list_head rcu_reader_sig::node -->
        <var-decl name='node' type-id='type-id-14' visibility='default' filepath='../include/urcu/static/urcu.h' line='139' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <!-- pthread_t rcu_reader_sig::tid -->
        <var-decl name='tid' type-id='type-id-15' visibility='default' filepath='../include/urcu/static/urcu.h' line='140' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <!-- unsigned int rcu_reader_sig::registered -->
        <var-decl name='registered' type-id='type-id-8' visibility='default' filepath='../include/urcu/static/urcu.h' line='142' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct cds_list_head -->
    <class-decl name='cds_list_head' size-in-bits='128' is-struct='yes' visibility='default' filepath='../include/urcu/list.h' line='35' column='1' id='type-id-14'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_list_head* cds_list_head::next -->
        <var-decl name='next' type-id='type-id-16' visibility='default' filepath='../include/urcu/list.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- cds_list_head* cds_list_head::prev -->
        <var-decl name='prev' type-id='type-id-16' visibility='default' filepath='../include/urcu/list.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef unsigned long int pthread_t -->
    <typedef-decl name='pthread_t' type-id='type-id-3' filepath='/usr/include/bits/pthreadtypes.h' line='27' column='1' id='type-id-15'/>
    <!-- struct rcu_flavor_struct -->
    <class-decl name='rcu_flavor_struct' size-in-bits='896' is-struct='yes' visibility='default' filepath='../src/urcu-flavor.h' line='40' column='1' id='type-id-17'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void ()* rcu_flavor_struct::read_lock -->
        <var-decl name='read_lock' type-id='type-id-18' visibility='default' filepath='../src/urcu-flavor.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void ()* rcu_flavor_struct::read_unlock -->
        <var-decl name='read_unlock' type-id='type-id-18' visibility='default' filepath='../src/urcu-flavor.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int ()* rcu_flavor_struct::read_ongoing -->
        <var-decl name='read_ongoing' type-id='type-id-19' visibility='default' filepath='../src/urcu-flavor.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- void ()* rcu_flavor_struct::read_quiescent_state -->
        <var-decl name='read_quiescent_state' type-id='type-id-18' visibility='default' filepath='../src/urcu-flavor.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- void (rcu_head*, void (rcu_head*)*)* rcu_flavor_struct::update_call_rcu -->
        <var-decl name='update_call_rcu' type-id='type-id-20' visibility='default' filepath='../src/urcu-flavor.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- void ()* rcu_flavor_struct::update_synchronize_rcu -->
        <var-decl name='update_synchronize_rcu' type-id='type-id-18' visibility='default' filepath='../src/urcu-flavor.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- void (void (void*)*, void*)* rcu_flavor_struct::update_defer_rcu -->
        <var-decl name='update_defer_rcu' type-id='type-id-21' visibility='default' filepath='../src/urcu-flavor.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- void ()* rcu_flavor_struct::thread_offline -->
        <var-decl name='thread_offline' type-id='type-id-18' visibility='default' filepath='../src/urcu-flavor.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- void ()* rcu_flavor_struct::thread_online -->
        <var-decl name='thread_online' type-id='type-id-18' visibility='default' filepath='../src/urcu-flavor.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- void ()* rcu_flavor_struct::register_thread -->
        <var-decl name='register_thread' type-id='type-id-18' visibility='default' filepath='../src/urcu-flavor.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- void ()* rcu_flavor_struct::unregister_thread -->
        <var-decl name='unregister_thread' type-id='type-id-18' visibility='default' filepath='../src/urcu-flavor.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- void ()* rcu_flavor_struct::barrier -->
        <var-decl name='barrier' type-id='type-id-18' visibility='default' filepath='../src/urcu-flavor.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <!-- void (urcu_atfork*)* rcu_flavor_struct::register_rculfhash_atfork -->
        <var-decl name='register_rculfhash_atfork' type-id='type-id-22' visibility='default' filepath='../src/urcu-flavor.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <!-- void (urcu_atfork*)* rcu_flavor_struct::unregister_rculfhash_atfork -->
        <var-decl name='unregister_rculfhash_atfork' type-id='type-id-22' visibility='default' filepath='../src/urcu-flavor.h' line='58' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct rcu_head -->
    <class-decl name='rcu_head' size-in-bits='128' is-struct='yes' visibility='default' filepath='../src/urcu-call-rcu.h' line='59' column='1' id='type-id-23'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_wfcq_node rcu_head::next -->
        <var-decl name='next' type-id='type-id-24' visibility='default' filepath='../src/urcu-call-rcu.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void (rcu_head*)* rcu_head::func -->
        <var-decl name='func' type-id='type-id-25' visibility='default' filepath='../src/urcu-call-rcu.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct cds_wfcq_node -->
    <class-decl name='cds_wfcq_node' size-in-bits='64' is-struct='yes' visibility='default' filepath='../include/urcu/wfcqueue.h' line='59' column='1' id='type-id-24'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_wfcq_node* cds_wfcq_node::next -->
        <var-decl name='next' type-id='type-id-26' visibility='default' filepath='../include/urcu/wfcqueue.h' line='60' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct urcu_atfork -->
    <class-decl name='urcu_atfork' size-in-bits='256' is-struct='yes' visibility='default' filepath='../src/urcu-flavor.h' line='30' column='1' id='type-id-27'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void (void*)* urcu_atfork::before_fork -->
        <var-decl name='before_fork' type-id='type-id-28' visibility='default' filepath='../src/urcu-flavor.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void (void*)* urcu_atfork::after_fork_parent -->
        <var-decl name='after_fork_parent' type-id='type-id-28' visibility='default' filepath='../src/urcu-flavor.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- void (void*)* urcu_atfork::after_fork_child -->
        <var-decl name='after_fork_child' type-id='type-id-28' visibility='default' filepath='../src/urcu-flavor.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- void* urcu_atfork::priv -->
        <var-decl name='priv' type-id='type-id-29' visibility='default' filepath='../src/urcu-flavor.h' line='34' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct call_rcu_data -->
    <class-decl name='call_rcu_data' size-in-bits='1024' is-struct='yes' visibility='default' filepath='src/urcu-call-rcu-impl.h' line='52' column='1' id='type-id-30'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_wfcq_tail call_rcu_data::cbs_tail -->
        <var-decl name='cbs_tail' type-id='type-id-31' visibility='default' filepath='src/urcu-call-rcu-impl.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- cds_wfcq_head call_rcu_data::cbs_head -->
        <var-decl name='cbs_head' type-id='type-id-32' visibility='default' filepath='src/urcu-call-rcu-impl.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- unsigned long int call_rcu_data::flags -->
        <var-decl name='flags' type-id='type-id-3' visibility='default' filepath='src/urcu-call-rcu-impl.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- int32_t call_rcu_data::futex -->
        <var-decl name='futex' type-id='type-id-11' visibility='default' filepath='src/urcu-call-rcu-impl.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- unsigned long int call_rcu_data::qlen -->
        <var-decl name='qlen' type-id='type-id-3' visibility='default' filepath='src/urcu-call-rcu-impl.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- pthread_t call_rcu_data::tid -->
        <var-decl name='tid' type-id='type-id-15' visibility='default' filepath='src/urcu-call-rcu-impl.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- int call_rcu_data::cpu_affinity -->
        <var-decl name='cpu_affinity' type-id='type-id-5' visibility='default' filepath='src/urcu-call-rcu-impl.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <!-- unsigned long int call_rcu_data::gp_count -->
        <var-decl name='gp_count' type-id='type-id-3' visibility='default' filepath='src/urcu-call-rcu-impl.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <!-- cds_list_head call_rcu_data::list -->
        <var-decl name='list' type-id='type-id-14' visibility='default' filepath='src/urcu-call-rcu-impl.h' line='68' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct cds_wfcq_tail -->
    <class-decl name='cds_wfcq_tail' size-in-bits='64' is-struct='yes' visibility='default' filepath='../include/urcu/wfcqueue.h' line='127' column='1' id='type-id-31'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_wfcq_node* cds_wfcq_tail::p -->
        <var-decl name='p' type-id='type-id-26' visibility='default' filepath='../include/urcu/wfcqueue.h' line='128' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct cds_wfcq_head -->
    <class-decl name='cds_wfcq_head' size-in-bits='384' is-struct='yes' visibility='default' filepath='../include/urcu/wfcqueue.h' line='72' column='1' id='type-id-32'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_wfcq_node cds_wfcq_head::node -->
        <var-decl name='node' type-id='type-id-24' visibility='default' filepath='../include/urcu/wfcqueue.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- pthread_mutex_t cds_wfcq_head::lock -->
        <var-decl name='lock' type-id='type-id-33' visibility='default' filepath='../include/urcu/wfcqueue.h' line='74' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef __anonymous_union__ pthread_mutex_t -->
    <typedef-decl name='pthread_mutex_t' type-id='type-id-34' filepath='/usr/include/bits/pthreadtypes.h' line='72' column='1' id='type-id-33'/>
    <!-- union {__pthread_mutex_s __data; char __size[40]; long int __align;} -->
    <union-decl name='__anonymous_union__' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='67' column='1' id='type-id-34'>
      <data-member access='private'>
        <!-- __pthread_mutex_s __data -->
        <var-decl name='__data' type-id='type-id-35' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='69' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char __size[40] -->
        <var-decl name='__size' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='70' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- long int __align -->
        <var-decl name='__align' type-id='type-id-6' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='71' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct __pthread_mutex_s -->
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='22' column='1' id='type-id-35'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int __pthread_mutex_s::__lock -->
        <var-decl name='__lock' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- unsigned int __pthread_mutex_s::__count -->
        <var-decl name='__count' type-id='type-id-8' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int __pthread_mutex_s::__owner -->
        <var-decl name='__owner' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- unsigned int __pthread_mutex_s::__nusers -->
        <var-decl name='__nusers' type-id='type-id-8' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int __pthread_mutex_s::__kind -->
        <var-decl name='__kind' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- short int __pthread_mutex_s::__spins -->
        <var-decl name='__spins' type-id='type-id-7' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <!-- short int __pthread_mutex_s::__elision -->
        <var-decl name='__elision' type-id='type-id-7' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- __pthread_list_t __pthread_mutex_s::__list -->
        <var-decl name='__list' type-id='type-id-36' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef __pthread_internal_list __pthread_list_t -->
    <typedef-decl name='__pthread_list_t' type-id='type-id-37' filepath='/usr/include/bits/thread-shared-types.h' line='53' column='1' id='type-id-36'/>
    <!-- struct __pthread_internal_list -->
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='49' column='1' id='type-id-37'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- __pthread_internal_list* __pthread_internal_list::__prev -->
        <var-decl name='__prev' type-id='type-id-38' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- __pthread_internal_list* __pthread_internal_list::__next -->
        <var-decl name='__next' type-id='type-id-38' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <!-- __pthread_internal_list* -->
    <pointer-type-def type-id='type-id-37' size-in-bits='64' id='type-id-38'/>
    <!-- call_rcu_data* -->
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-39'/>
    <!-- cds_list_head* -->
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-16'/>
    <!-- cds_wfcq_node* -->
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-26'/>
    <!-- const rcu_flavor_struct -->
    <qualified-type-def type-id='type-id-17' const='yes' id='type-id-40'/>
    <!-- int ()* -->
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-19'/>
    <!-- rcu_head* -->
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-42'/>
    <!-- urcu_atfork* -->
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-43'/>
    <!-- void ()* -->
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-18'/>
    <!-- void (rcu_head*)* -->
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-25'/>
    <!-- void (rcu_head*, void (rcu_head*)*)* -->
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-20'/>
    <!-- void (urcu_atfork*)* -->
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-22'/>
    <!-- void (void (void*)*, void*)* -->
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-21'/>
    <!-- void (void*)* -->
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-28'/>
    <!-- void* -->
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-29'/>
    <!-- rcu_gp_sig rcu_gp_sig -->
    <var-decl name='rcu_gp_sig' type-id='type-id-10' mangled-name='rcu_gp_sig' visibility='default' filepath='../include/urcu/static/urcu.h' line='132' column='1' elf-symbol-id='rcu_gp_sig'/>
    <!-- rcu_reader_sig rcu_reader_sig -->
    <var-decl name='rcu_reader_sig' type-id='type-id-13' mangled-name='rcu_reader_sig' visibility='default' filepath='../include/urcu/static/urcu.h' line='145' column='1' elf-symbol-id='rcu_reader_sig'/>
    <!-- const rcu_flavor_struct rcu_flavor_sig -->
    <var-decl name='rcu_flavor_sig' type-id='type-id-40' mangled-name='rcu_flavor_sig' visibility='default' filepath='../src/urcu-flavor.h' line='79' column='1' elf-symbol-id='rcu_flavor_sig'/>
    <!-- void rcu_defer_exit_sig() -->
    <function-decl name='rcu_defer_exit_sig' mangled-name='rcu_defer_exit_sig' filepath='src/urcu-defer-impl.h' line='466' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_defer_exit_sig'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void rcu_defer_unregister_thread_sig() -->
    <function-decl name='rcu_defer_unregister_thread_sig' mangled-name='rcu_defer_unregister_thread_sig' filepath='src/urcu-defer-impl.h' line='448' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_defer_unregister_thread_sig'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- int rcu_defer_register_thread_sig() -->
    <function-decl name='rcu_defer_register_thread_sig' mangled-name='rcu_defer_register_thread_sig' filepath='src/urcu-defer-impl.h' line='426' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_defer_register_thread_sig'>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- void defer_rcu_sig(void (void*)*, void*) -->
    <function-decl name='defer_rcu_sig' mangled-name='defer_rcu_sig' filepath='src/urcu-defer-impl.h' line='395' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='defer_rcu_sig'>
      <!-- parameter of type 'void (void*)*' -->
      <parameter type-id='type-id-28' name='fct' filepath='src/urcu-defer-impl.h' line='395' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-29' name='p' filepath='src/urcu-defer-impl.h' line='395' column='1'/>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void rcu_defer_barrier_sig() -->
    <function-decl name='rcu_defer_barrier_sig' mangled-name='rcu_defer_barrier_sig' filepath='src/urcu-defer-impl.h' line='281' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_defer_barrier_sig'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void rcu_defer_barrier_thread_sig() -->
    <function-decl name='rcu_defer_barrier_thread_sig' mangled-name='rcu_defer_barrier_thread_sig' filepath='src/urcu-defer-impl.h' line='261' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_defer_barrier_thread_sig'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void urcu_unregister_rculfhash_atfork_sig(urcu_atfork*) -->
    <function-decl name='urcu_unregister_rculfhash_atfork_sig' mangled-name='urcu_unregister_rculfhash_atfork_sig' filepath='src/urcu-call-rcu-impl.h' line='1011' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='urcu_unregister_rculfhash_atfork_sig'>
      <!-- parameter of type 'urcu_atfork*' -->
      <parameter type-id='type-id-43' name='atfork' filepath='src/urcu-call-rcu-impl.h' line='1011' column='1'/>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void urcu_register_rculfhash_atfork_sig(urcu_atfork*) -->
    <function-decl name='urcu_register_rculfhash_atfork_sig' mangled-name='urcu_register_rculfhash_atfork_sig' filepath='src/urcu-call-rcu-impl.h' line='1001' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='urcu_register_rculfhash_atfork_sig'>
      <!-- parameter of type 'urcu_atfork*' -->
      <parameter type-id='type-id-43' name='atfork' filepath='src/urcu-call-rcu-impl.h' line='1001' column='1'/>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void call_rcu_after_fork_child_sig() -->
    <function-decl name='call_rcu_after_fork_child_sig' mangled-name='call_rcu_after_fork_child_sig' filepath='src/urcu-call-rcu-impl.h' line='959' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='call_rcu_after_fork_child_sig'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void call_rcu_after_fork_parent_sig() -->
    <function-decl name='call_rcu_after_fork_parent_sig' mangled-name='call_rcu_after_fork_parent_sig' filepath='src/urcu-call-rcu-impl.h' line='937' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='call_rcu_after_fork_parent_sig'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void call_rcu_before_fork_sig() -->
    <function-decl name='call_rcu_before_fork_sig' mangled-name='call_rcu_before_fork_sig' filepath='src/urcu-call-rcu-impl.h' line='910' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='call_rcu_before_fork_sig'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void rcu_barrier_sig() -->
    <function-decl name='rcu_barrier_sig' mangled-name='rcu_barrier_sig' filepath='src/urcu-call-rcu-impl.h' line='839' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_barrier_sig'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void free_all_cpu_call_rcu_data_sig() -->
    <function-decl name='free_all_cpu_call_rcu_data_sig' mangled-name='free_all_cpu_call_rcu_data_sig' filepath='src/urcu-call-rcu-impl.h' line='776' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='free_all_cpu_call_rcu_data_sig'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void call_rcu_data_free_sig(call_rcu_data*) -->
    <function-decl name='call_rcu_data_free_sig' mangled-name='call_rcu_data_free_sig' filepath='src/urcu-call-rcu-impl.h' line='744' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='call_rcu_data_free_sig'>
      <!-- parameter of type 'call_rcu_data*' -->
      <parameter type-id='type-id-39' name='crdp' filepath='src/urcu-call-rcu-impl.h' line='744' column='1'/>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void call_rcu_sig(rcu_head*, void (rcu_head*)*) -->
    <function-decl name='call_rcu_sig' mangled-name='call_rcu_sig' filepath='src/urcu-call-rcu-impl.h' line='706' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='call_rcu_sig'>
      <!-- parameter of type 'rcu_head*' -->
      <parameter type-id='type-id-42' name='head' filepath='src/urcu-call-rcu-impl.h' line='706' column='1'/>
      <!-- parameter of type 'void (rcu_head*)*' -->
      <parameter type-id='type-id-25' name='func' filepath='src/urcu-call-rcu-impl.h' line='707' column='1'/>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- int create_all_cpu_call_rcu_data_sig(unsigned long int) -->
    <function-decl name='create_all_cpu_call_rcu_data_sig' mangled-name='create_all_cpu_call_rcu_data_sig' filepath='src/urcu-call-rcu-impl.h' line='628' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='create_all_cpu_call_rcu_data_sig'>
      <!-- parameter of type 'unsigned long int' -->
      <parameter type-id='type-id-3' name='flags' filepath='src/urcu-call-rcu-impl.h' line='628' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- void set_thread_call_rcu_data_sig(call_rcu_data*) -->
    <function-decl name='set_thread_call_rcu_data_sig' mangled-name='set_thread_call_rcu_data_sig' filepath='src/urcu-call-rcu-impl.h' line='615' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='set_thread_call_rcu_data_sig'>
      <!-- parameter of type 'call_rcu_data*' -->
      <parameter type-id='type-id-39' name='crdp' filepath='src/urcu-call-rcu-impl.h' line='615' column='1'/>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- call_rcu_data* get_thread_call_rcu_data_sig() -->
    <function-decl name='get_thread_call_rcu_data_sig' mangled-name='get_thread_call_rcu_data_sig' filepath='src/urcu-call-rcu-impl.h' line='599' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_thread_call_rcu_data_sig'>
      <!-- call_rcu_data* -->
      <return type-id='type-id-39'/>
    </function-decl>
    <!-- call_rcu_data* get_call_rcu_data_sig() -->
    <function-decl name='get_call_rcu_data_sig' mangled-name='get_call_rcu_data_sig' filepath='src/urcu-call-rcu-impl.h' line='579' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_call_rcu_data_sig'>
      <!-- call_rcu_data* -->
      <return type-id='type-id-39'/>
    </function-decl>
    <!-- call_rcu_data* get_default_call_rcu_data_sig() -->
    <function-decl name='get_default_call_rcu_data_sig' mangled-name='get_default_call_rcu_data_sig' filepath='src/urcu-call-rcu-impl.h' line='554' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_default_call_rcu_data_sig'>
      <!-- call_rcu_data* -->
      <return type-id='type-id-39'/>
    </function-decl>
    <!-- int set_cpu_call_rcu_data_sig(int, call_rcu_data*) -->
    <function-decl name='set_cpu_call_rcu_data_sig' mangled-name='set_cpu_call_rcu_data_sig' filepath='src/urcu-call-rcu-impl.h' line='515' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='set_cpu_call_rcu_data_sig'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='cpu' filepath='src/urcu-call-rcu-impl.h' line='515' column='1'/>
      <!-- parameter of type 'call_rcu_data*' -->
      <parameter type-id='type-id-39' name='crdp' filepath='src/urcu-call-rcu-impl.h' line='515' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- call_rcu_data* create_call_rcu_data_sig(unsigned long int, int) -->
    <function-decl name='create_call_rcu_data_sig' mangled-name='create_call_rcu_data_sig' filepath='src/urcu-call-rcu-impl.h' line='491' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='create_call_rcu_data_sig'>
      <!-- parameter of type 'unsigned long int' -->
      <parameter type-id='type-id-3' name='flags' filepath='src/urcu-call-rcu-impl.h' line='491' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='cpu_affinity' filepath='src/urcu-call-rcu-impl.h' line='492' column='1'/>
      <!-- call_rcu_data* -->
      <return type-id='type-id-39'/>
    </function-decl>
    <!-- pthread_t get_call_rcu_thread_sig(call_rcu_data*) -->
    <function-decl name='get_call_rcu_thread_sig' mangled-name='get_call_rcu_thread_sig' filepath='src/urcu-call-rcu-impl.h' line='473' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_call_rcu_thread_sig'>
      <!-- parameter of type 'call_rcu_data*' -->
      <parameter type-id='type-id-39' name='crdp' filepath='src/urcu-call-rcu-impl.h' line='473' column='1'/>
      <!-- typedef pthread_t -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- call_rcu_data* get_cpu_call_rcu_data_sig(int) -->
    <function-decl name='get_cpu_call_rcu_data_sig' mangled-name='get_cpu_call_rcu_data_sig' filepath='src/urcu-call-rcu-impl.h' line='451' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_cpu_call_rcu_data_sig'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='cpu' filepath='src/urcu-call-rcu-impl.h' line='451' column='1'/>
      <!-- call_rcu_data* -->
      <return type-id='type-id-39'/>
    </function-decl>
    <!-- void rcu_exit_sig() -->
    <function-decl name='rcu_exit_sig' mangled-name='rcu_exit_sig' filepath='src/urcu.c' line='604' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_exit_sig'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void rcu_init_sig() -->
    <function-decl name='rcu_init_sig' mangled-name='rcu_init_sig' filepath='src/urcu.c' line='587' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_init_sig'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void rcu_unregister_thread_sig() -->
    <function-decl name='rcu_unregister_thread_sig' mangled-name='rcu_unregister_thread_sig' filepath='src/urcu.c' line='527' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_unregister_thread_sig'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void rcu_register_thread_sig() -->
    <function-decl name='rcu_register_thread_sig' mangled-name='rcu_register_thread_sig' filepath='src/urcu.c' line='513' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_register_thread_sig'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- int rcu_read_ongoing_sig() -->
    <function-decl name='rcu_read_ongoing_sig' mangled-name='rcu_read_ongoing_sig' filepath='src/urcu.c' line='508' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_read_ongoing_sig'>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- void rcu_read_unlock_sig() -->
    <function-decl name='rcu_read_unlock_sig' mangled-name='rcu_read_unlock_sig' filepath='src/urcu.c' line='503' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_read_unlock_sig'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void rcu_read_lock_sig() -->
    <function-decl name='rcu_read_lock_sig' mangled-name='rcu_read_lock_sig' filepath='src/urcu.c' line='498' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_read_lock_sig'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void synchronize_rcu_sig() -->
    <function-decl name='synchronize_rcu_sig' mangled-name='synchronize_rcu_sig' filepath='src/urcu.c' line='377' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='synchronize_rcu_sig'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- int () -->
    <function-type size-in-bits='64' id='type-id-41'>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-type>
    <!-- void () -->
    <function-type size-in-bits='64' id='type-id-44'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-type>
    <!-- void (rcu_head*) -->
    <function-type size-in-bits='64' id='type-id-45'>
      <!-- parameter of type 'rcu_head*' -->
      <parameter type-id='type-id-42'/>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-type>
    <!-- void (rcu_head*, void (rcu_head*)*) -->
    <function-type size-in-bits='64' id='type-id-46'>
      <!-- parameter of type 'rcu_head*' -->
      <parameter type-id='type-id-42'/>
      <!-- parameter of type 'void (rcu_head*)*' -->
      <parameter type-id='type-id-25'/>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-type>
    <!-- void (urcu_atfork*) -->
    <function-type size-in-bits='64' id='type-id-47'>
      <!-- parameter of type 'urcu_atfork*' -->
      <parameter type-id='type-id-43'/>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-type>
    <!-- void (void (void*)*, void*) -->
    <function-type size-in-bits='64' id='type-id-48'>
      <!-- parameter of type 'void (void*)*' -->
      <parameter type-id='type-id-28'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-29'/>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-type>
    <!-- void (void*) -->
    <function-type size-in-bits='64' id='type-id-49'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-29'/>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='urcu-pointer.c' comp-dir-path='src' language='LANG_C99'>
    <!-- void** -->
    <pointer-type-def type-id='type-id-29' size-in-bits='64' id='type-id-50'/>
    <!-- void* rcu_cmpxchg_pointer_sym(void**, void*, void*) -->
    <function-decl name='rcu_cmpxchg_pointer_sym' mangled-name='rcu_cmpxchg_pointer_sym' filepath='src/urcu-pointer.c' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_cmpxchg_pointer_sym'>
      <!-- parameter of type 'void**' -->
      <parameter type-id='type-id-50' name='p' filepath='src/urcu-pointer.c' line='53' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-29' name='old' filepath='src/urcu-pointer.c' line='53' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-29' name='_new' filepath='src/urcu-pointer.c' line='53' column='1'/>
      <!-- void* -->
      <return type-id='type-id-29'/>
    </function-decl>
    <!-- void* rcu_xchg_pointer_sym(void**, void*) -->
    <function-decl name='rcu_xchg_pointer_sym' mangled-name='rcu_xchg_pointer_sym' filepath='src/urcu-pointer.c' line='47' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_xchg_pointer_sym'>
      <!-- parameter of type 'void**' -->
      <parameter type-id='type-id-50' name='p' filepath='src/urcu-pointer.c' line='47' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-29' name='v' filepath='src/urcu-pointer.c' line='47' column='1'/>
      <!-- void* -->
      <return type-id='type-id-29'/>
    </function-decl>
    <!-- void* rcu_set_pointer_sym(void**, void*) -->
    <function-decl name='rcu_set_pointer_sym' mangled-name='rcu_set_pointer_sym' filepath='src/urcu-pointer.c' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_set_pointer_sym'>
      <!-- parameter of type 'void**' -->
      <parameter type-id='type-id-50' name='p' filepath='src/urcu-pointer.c' line='40' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-29' name='v' filepath='src/urcu-pointer.c' line='40' column='1'/>
      <!-- void* -->
      <return type-id='type-id-29'/>
    </function-decl>
    <!-- void* rcu_dereference_sym(void*) -->
    <function-decl name='rcu_dereference_sym' mangled-name='rcu_dereference_sym' filepath='src/urcu-pointer.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_dereference_sym'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-29' name='p' filepath='src/urcu-pointer.c' line='35' column='1'/>
      <!-- void* -->
      <return type-id='type-id-29'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='compat_futex.c' comp-dir-path='src' language='LANG_C99'>


    <!-- char[48] -->
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='384' id='type-id-51'>
      <!-- <anonymous range>[48] -->
      <subrange length='48' type-id='type-id-3' id='type-id-52'/>

    </array-type-def>
    <!-- long long int -->
    <type-decl name='long long int' size-in-bits='64' id='type-id-53'/>
    <!-- long long unsigned int -->
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-54'/>
    <!-- unsigned int[2] -->
    <array-type-def dimensions='1' type-id='type-id-8' size-in-bits='64' id='type-id-55'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' type-id='type-id-3' id='type-id-56'/>

    </array-type-def>
    <!-- typedef __anonymous_union__ pthread_cond_t -->
    <typedef-decl name='pthread_cond_t' type-id='type-id-57' filepath='/usr/include/bits/pthreadtypes.h' line='80' column='1' id='type-id-58'/>
    <!-- union {__pthread_cond_s __data; char __size[48]; long long int __align;} -->
    <union-decl name='__anonymous_union__' size-in-bits='384' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='75' column='1' id='type-id-57'>
      <data-member access='private'>
        <!-- __pthread_cond_s __data -->
        <var-decl name='__data' type-id='type-id-59' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='77' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char __size[48] -->
        <var-decl name='__size' type-id='type-id-51' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='78' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- long long int __align -->
        <var-decl name='__align' type-id='type-id-53' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='79' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct __pthread_cond_s -->
    <class-decl name='__pthread_cond_s' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='92' column='1' id='type-id-59'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- union {long long unsigned int __wseq; struct {unsigned int __low; unsigned int __high;} __wseq32;} -->
        <var-decl name='' type-id='type-id-60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- unsigned int __pthread_cond_s::__g_refs[2] -->
        <var-decl name='__g_refs' type-id='type-id-55' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- unsigned int __pthread_cond_s::__g_size[2] -->
        <var-decl name='__g_size' type-id='type-id-55' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- unsigned int __pthread_cond_s::__g1_orig_size -->
        <var-decl name='__g1_orig_size' type-id='type-id-8' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- unsigned int __pthread_cond_s::__wrefs -->
        <var-decl name='__wrefs' type-id='type-id-8' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- unsigned int __pthread_cond_s::__g_signals[2] -->
        <var-decl name='__g_signals' type-id='type-id-55' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='116' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {long long unsigned int __wseq; struct {unsigned int __low; unsigned int __high;} __wseq32;} -->
    <union-decl name='__anonymous_union__1' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='94' column='1' id='type-id-60'>
      <data-member access='private'>
        <!-- long long unsigned int __wseq -->
        <var-decl name='__wseq' type-id='type-id-54' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='96' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {unsigned int __low; unsigned int __high;} __wseq32 -->
        <var-decl name='__wseq32' type-id='type-id-61' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='101' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct {unsigned int __low; unsigned int __high;} -->
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='97' column='1' id='type-id-61'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned int __low -->
        <var-decl name='__low' type-id='type-id-8' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- unsigned int __high -->
        <var-decl name='__high' type-id='type-id-8' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='100' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct timespec -->
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='10' column='1' id='type-id-62'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- __time_t timespec::tv_sec -->
        <var-decl name='tv_sec' type-id='type-id-63' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- __syscall_slong_t timespec::tv_nsec -->
        <var-decl name='tv_nsec' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='16' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef long int __time_t -->
    <typedef-decl name='__time_t' type-id='type-id-6' filepath='/usr/include/bits/types.h' line='160' column='1' id='type-id-63'/>
    <!-- typedef long int __syscall_slong_t -->
    <typedef-decl name='__syscall_slong_t' type-id='type-id-6' filepath='/usr/include/bits/types.h' line='197' column='1' id='type-id-64'/>
    <!-- const timespec -->
    <qualified-type-def type-id='type-id-62' const='yes' id='type-id-65'/>
    <!-- const timespec* -->
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-66'/>
    <!-- int32_t* -->
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-67'/>
    <!-- pthread_mutex_t __urcu_compat_futex_lock -->
    <var-decl name='__urcu_compat_futex_lock' type-id='type-id-33' mangled-name='__urcu_compat_futex_lock' visibility='default' filepath='src/compat_futex.c' line='44' column='1' elf-symbol-id='__urcu_compat_futex_lock'/>
    <!-- pthread_cond_t __urcu_compat_futex_cond -->
    <var-decl name='__urcu_compat_futex_cond' type-id='type-id-58' mangled-name='__urcu_compat_futex_cond' visibility='default' filepath='src/compat_futex.c' line='46' column='1' elf-symbol-id='__urcu_compat_futex_cond'/>
    <!-- int compat_futex_async(int32_t*, int, int32_t, const timespec*, int32_t*, int32_t) -->
    <function-decl name='compat_futex_async' mangled-name='compat_futex_async' filepath='src/compat_futex.c' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='compat_futex_async'>
      <!-- parameter of type 'int32_t*' -->
      <parameter type-id='type-id-67' name='uaddr' filepath='src/compat_futex.c' line='118' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='op' filepath='src/compat_futex.c' line='118' column='1'/>
      <!-- parameter of type 'typedef int32_t' -->
      <parameter type-id='type-id-11' name='val' filepath='src/compat_futex.c' line='118' column='1'/>
      <!-- parameter of type 'const timespec*' -->
      <parameter type-id='type-id-66' name='timeout' filepath='src/compat_futex.c' line='119' column='1'/>
      <!-- parameter of type 'int32_t*' -->
      <parameter type-id='type-id-67' name='uaddr2' filepath='src/compat_futex.c' line='119' column='1'/>
      <!-- parameter of type 'typedef int32_t' -->
      <parameter type-id='type-id-11' name='val3' filepath='src/compat_futex.c' line='119' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- int compat_futex_noasync(int32_t*, int, int32_t, const timespec*, int32_t*, int32_t) -->
    <function-decl name='compat_futex_noasync' mangled-name='compat_futex_noasync' filepath='src/compat_futex.c' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='compat_futex_noasync'>
      <!-- parameter of type 'int32_t*' -->
      <parameter type-id='type-id-67' name='uaddr' filepath='src/compat_futex.c' line='54' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='op' filepath='src/compat_futex.c' line='54' column='1'/>
      <!-- parameter of type 'typedef int32_t' -->
      <parameter type-id='type-id-11' name='val' filepath='src/compat_futex.c' line='54' column='1'/>
      <!-- parameter of type 'const timespec*' -->
      <parameter type-id='type-id-66' name='timeout' filepath='src/compat_futex.c' line='55' column='1'/>
      <!-- parameter of type 'int32_t*' -->
      <parameter type-id='type-id-67' name='uaddr2' filepath='src/compat_futex.c' line='55' column='1'/>
      <!-- parameter of type 'typedef int32_t' -->
