<abi-corpus architecture='elf-amd-x86_64' soname='liburcu-bp.so.6'>
  <elf-needed>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <!-- _fini -->
    <elf-symbol name='_fini' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- _init -->
    <elf-symbol name='_init' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- call_rcu_after_fork_child_bp -->
    <elf-symbol name='call_rcu_after_fork_child_bp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- call_rcu_after_fork_parent_bp -->
    <elf-symbol name='call_rcu_after_fork_parent_bp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- call_rcu_before_fork_bp -->
    <elf-symbol name='call_rcu_before_fork_bp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- call_rcu_bp -->
    <elf-symbol name='call_rcu_bp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- call_rcu_data_free_bp -->
    <elf-symbol name='call_rcu_data_free_bp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- compat_futex_async -->

    <elf-symbol name='rcu_bp_after_fork_parent' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_bp_before_fork -->
    <elf-symbol name='rcu_bp_before_fork' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_bp_register -->
    <elf-symbol name='rcu_bp_register' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_cmpxchg_pointer_sym -->
    <elf-symbol name='rcu_cmpxchg_pointer_sym' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_cmpxchg_pointer_sym_bp -->
    <elf-symbol name='rcu_cmpxchg_pointer_sym_bp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_defer_barrier_bp -->
    <elf-symbol name='rcu_defer_barrier_bp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_defer_barrier_thread_bp -->
    <elf-symbol name='rcu_defer_barrier_thread_bp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_defer_exit_bp -->
    <elf-symbol name='rcu_defer_exit_bp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_defer_register_thread_bp -->
    <elf-symbol name='rcu_defer_register_thread_bp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_defer_unregister_thread_bp -->
    <elf-symbol name='rcu_defer_unregister_thread_bp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_dereference_sym -->
    <elf-symbol name='rcu_dereference_sym' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_dereference_sym_bp -->
    <elf-symbol name='rcu_dereference_sym_bp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_read_lock_bp -->
    <elf-symbol name='rcu_read_lock_bp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_read_ongoing_bp -->
    <elf-symbol name='rcu_read_ongoing_bp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_read_unlock_bp -->
    <elf-symbol name='rcu_read_unlock_bp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_set_pointer_sym -->
    <elf-symbol name='rcu_set_pointer_sym' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_set_pointer_sym_bp -->
    <elf-symbol name='rcu_set_pointer_sym_bp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_xchg_pointer_sym -->
    <elf-symbol name='rcu_xchg_pointer_sym' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_xchg_pointer_sym_bp -->
    <elf-symbol name='rcu_xchg_pointer_sym_bp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- set_cpu_call_rcu_data_bp -->
    <elf-symbol name='set_cpu_call_rcu_data_bp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- set_thread_call_rcu_data_bp -->
    <elf-symbol name='set_thread_call_rcu_data_bp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- synchronize_rcu_bp -->
    <elf-symbol name='synchronize_rcu_bp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- urcu_register_rculfhash_atfork_bp -->
    <elf-symbol name='urcu_register_rculfhash_atfork_bp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- urcu_unregister_rculfhash_atfork_bp -->
    <elf-symbol name='urcu_unregister_rculfhash_atfork_bp' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <!-- __urcu_compat_futex_cond -->
    <elf-symbol name='__urcu_compat_futex_cond' size='48' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- __urcu_compat_futex_lock -->
    <elf-symbol name='__urcu_compat_futex_lock' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_flavor_bp -->
    <elf-symbol name='rcu_flavor_bp' size='112' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_gp_bp -->
    <elf-symbol name='rcu_gp_bp' size='128' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_reader_bp -->
    <elf-symbol name='rcu_reader_bp' size='8' type='tls-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- urcu_bp_has_sys_membarrier -->
    <elf-symbol name='urcu_bp_has_sys_membarrier' size='4' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='urcu-bp.c' comp-dir-path='src' language='LANG_C99'>
    <!-- int -->
    <type-decl name='int' size-in-bits='32' id='type-id-1'/>
    <!-- int urcu_bp_has_sys_membarrier -->
    <var-decl name='urcu_bp_has_sys_membarrier' type-id='type-id-1' mangled-name='urcu_bp_has_sys_membarrier' visibility='default' filepath='../include/urcu/static/urcu-bp.h' line='109' column='1' elf-symbol-id='urcu_bp_has_sys_membarrier'/>
    <!-- struct rcu_gp_bp -->
    <class-decl name='rcu_gp_bp' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../include/urcu/static/urcu-bp.h' line='77' column='1' id='type-id-2'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned long int rcu_gp_bp::ctr -->
        <var-decl name='ctr' type-id='type-id-3' visibility='default' filepath='../include/urcu/static/urcu-bp.h' line='85' column='1'/>
      </data-member>
    </class-decl>
    <!-- unsigned long int -->
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-3'/>
    <!-- rcu_gp_bp rcu_gp_bp -->
    <var-decl name='rcu_gp_bp' type-id='type-id-2' mangled-name='rcu_gp_bp' visibility='default' filepath='../include/urcu/static/urcu-bp.h' line='88' column='1' elf-symbol-id='rcu_gp_bp'/>
    <!-- struct rcu_reader_bp -->
    <class-decl name='rcu_reader_bp' size-in-bits='2048' is-struct='yes' visibility='default' filepath='../include/urcu/static/urcu-bp.h' line='90' column='1' id='type-id-4'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned long int rcu_reader_bp::ctr -->
        <var-decl name='ctr' type-id='type-id-3' visibility='default' filepath='../include/urcu/static/urcu-bp.h' line='92' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- cds_list_head rcu_reader_bp::node -->
        <var-decl name='node' type-id='type-id-5' visibility='default' filepath='../include/urcu/static/urcu-bp.h' line='94' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <!-- pthread_t rcu_reader_bp::tid -->
        <var-decl name='tid' type-id='type-id-6' visibility='default' filepath='../include/urcu/static/urcu-bp.h' line='95' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <!-- int rcu_reader_bp::alloc -->
        <var-decl name='alloc' type-id='type-id-1' visibility='default' filepath='../include/urcu/static/urcu-bp.h' line='96' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct cds_list_head -->
    <class-decl name='cds_list_head' size-in-bits='128' is-struct='yes' visibility='default' filepath='../include/urcu/list.h' line='35' column='1' id='type-id-5'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_list_head* cds_list_head::next -->
        <var-decl name='next' type-id='type-id-7' visibility='default' filepath='../include/urcu/list.h' line='36' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- cds_list_head* cds_list_head::prev -->
        <var-decl name='prev' type-id='type-id-7' visibility='default' filepath='../include/urcu/list.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <!-- cds_list_head* -->
    <pointer-type-def type-id='type-id-5' size-in-bits='64' id='type-id-7'/>
    <!-- typedef unsigned long int pthread_t -->
    <typedef-decl name='pthread_t' type-id='type-id-3' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='27' column='1' id='type-id-6'/>
    <!-- rcu_reader_bp* -->
    <pointer-type-def type-id='type-id-4' size-in-bits='64' id='type-id-8'/>
    <!-- rcu_reader_bp* rcu_reader_bp -->
    <var-decl name='rcu_reader_bp' type-id='type-id-8' mangled-name='rcu_reader_bp' visibility='default' filepath='../include/urcu/static/urcu-bp.h' line='104' column='1' elf-symbol-id='rcu_reader_bp'/>
    <!-- struct rcu_flavor_struct -->
    <class-decl name='rcu_flavor_struct' size-in-bits='896' is-struct='yes' visibility='default' filepath='../src/urcu-flavor.h' line='40' column='1' id='type-id-9'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void ()* rcu_flavor_struct::read_lock -->
        <var-decl name='read_lock' type-id='type-id-10' visibility='default' filepath='../src/urcu-flavor.h' line='41' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void ()* rcu_flavor_struct::read_unlock -->
        <var-decl name='read_unlock' type-id='type-id-10' visibility='default' filepath='../src/urcu-flavor.h' line='42' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int ()* rcu_flavor_struct::read_ongoing -->
        <var-decl name='read_ongoing' type-id='type-id-11' visibility='default' filepath='../src/urcu-flavor.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- void ()* rcu_flavor_struct::read_quiescent_state -->
        <var-decl name='read_quiescent_state' type-id='type-id-10' visibility='default' filepath='../src/urcu-flavor.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- void (rcu_head*, void (rcu_head*)*)* rcu_flavor_struct::update_call_rcu -->
        <var-decl name='update_call_rcu' type-id='type-id-12' visibility='default' filepath='../src/urcu-flavor.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- void ()* rcu_flavor_struct::update_synchronize_rcu -->
        <var-decl name='update_synchronize_rcu' type-id='type-id-10' visibility='default' filepath='../src/urcu-flavor.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- void (void (void*)*, void*)* rcu_flavor_struct::update_defer_rcu -->
        <var-decl name='update_defer_rcu' type-id='type-id-13' visibility='default' filepath='../src/urcu-flavor.h' line='48' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- void ()* rcu_flavor_struct::thread_offline -->
        <var-decl name='thread_offline' type-id='type-id-10' visibility='default' filepath='../src/urcu-flavor.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- void ()* rcu_flavor_struct::thread_online -->
        <var-decl name='thread_online' type-id='type-id-10' visibility='default' filepath='../src/urcu-flavor.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- void ()* rcu_flavor_struct::register_thread -->
        <var-decl name='register_thread' type-id='type-id-10' visibility='default' filepath='../src/urcu-flavor.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- void ()* rcu_flavor_struct::unregister_thread -->
        <var-decl name='unregister_thread' type-id='type-id-10' visibility='default' filepath='../src/urcu-flavor.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- void ()* rcu_flavor_struct::barrier -->
        <var-decl name='barrier' type-id='type-id-10' visibility='default' filepath='../src/urcu-flavor.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <!-- void (urcu_atfork*)* rcu_flavor_struct::register_rculfhash_atfork -->
        <var-decl name='register_rculfhash_atfork' type-id='type-id-14' visibility='default' filepath='../src/urcu-flavor.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <!-- void (urcu_atfork*)* rcu_flavor_struct::unregister_rculfhash_atfork -->
        <var-decl name='unregister_rculfhash_atfork' type-id='type-id-14' visibility='default' filepath='../src/urcu-flavor.h' line='58' column='1'/>
      </data-member>
    </class-decl>
    <!-- void -->
    <type-decl name='void' id='type-id-15'/>
    <!-- void ()* -->
    <pointer-type-def type-id='type-id-16' size-in-bits='64' id='type-id-10'/>
    <!-- int ()* -->
    <pointer-type-def type-id='type-id-17' size-in-bits='64' id='type-id-11'/>
    <!-- struct rcu_head -->
    <class-decl name='rcu_head' size-in-bits='128' is-struct='yes' visibility='default' filepath='../src/urcu-call-rcu.h' line='59' column='1' id='type-id-18'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_wfcq_node rcu_head::next -->
        <var-decl name='next' type-id='type-id-19' visibility='default' filepath='../src/urcu-call-rcu.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void (rcu_head*)* rcu_head::func -->
        <var-decl name='func' type-id='type-id-20' visibility='default' filepath='../src/urcu-call-rcu.h' line='61' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct cds_wfcq_node -->
    <class-decl name='cds_wfcq_node' size-in-bits='64' is-struct='yes' visibility='default' filepath='../include/urcu/wfcqueue.h' line='59' column='1' id='type-id-19'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_wfcq_node* cds_wfcq_node::next -->
        <var-decl name='next' type-id='type-id-21' visibility='default' filepath='../include/urcu/wfcqueue.h' line='60' column='1'/>
      </data-member>
    </class-decl>
    <!-- cds_wfcq_node* -->
    <pointer-type-def type-id='type-id-19' size-in-bits='64' id='type-id-21'/>
    <!-- rcu_head* -->
    <pointer-type-def type-id='type-id-18' size-in-bits='64' id='type-id-22'/>
    <!-- void (rcu_head*)* -->
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-20'/>
    <!-- void (rcu_head*, void (rcu_head*)*)* -->
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-12'/>
    <!-- void* -->
    <pointer-type-def type-id='type-id-15' size-in-bits='64' id='type-id-25'/>
    <!-- void (void*)* -->
    <pointer-type-def type-id='type-id-26' size-in-bits='64' id='type-id-27'/>
    <!-- void (void (void*)*, void*)* -->
    <pointer-type-def type-id='type-id-28' size-in-bits='64' id='type-id-13'/>
    <!-- struct urcu_atfork -->
    <class-decl name='urcu_atfork' size-in-bits='256' is-struct='yes' visibility='default' filepath='../src/urcu-flavor.h' line='30' column='1' id='type-id-29'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void (void*)* urcu_atfork::before_fork -->
        <var-decl name='before_fork' type-id='type-id-27' visibility='default' filepath='../src/urcu-flavor.h' line='31' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void (void*)* urcu_atfork::after_fork_parent -->
        <var-decl name='after_fork_parent' type-id='type-id-27' visibility='default' filepath='../src/urcu-flavor.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- void (void*)* urcu_atfork::after_fork_child -->
        <var-decl name='after_fork_child' type-id='type-id-27' visibility='default' filepath='../src/urcu-flavor.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- void* urcu_atfork::priv -->
        <var-decl name='priv' type-id='type-id-25' visibility='default' filepath='../src/urcu-flavor.h' line='34' column='1'/>
      </data-member>
    </class-decl>
    <!-- urcu_atfork* -->
    <pointer-type-def type-id='type-id-29' size-in-bits='64' id='type-id-30'/>
    <!-- void (urcu_atfork*)* -->
    <pointer-type-def type-id='type-id-31' size-in-bits='64' id='type-id-14'/>
    <!-- const rcu_flavor_struct -->
    <qualified-type-def type-id='type-id-9' const='yes' id='type-id-32'/>
    <!-- const rcu_flavor_struct rcu_flavor_bp -->
    <var-decl name='rcu_flavor_bp' type-id='type-id-32' mangled-name='rcu_flavor_bp' visibility='default' filepath='../src/urcu-flavor.h' line='79' column='1' elf-symbol-id='rcu_flavor_bp'/>
    <!-- void rcu_defer_exit_bp() -->
    <function-decl name='rcu_defer_exit_bp' mangled-name='rcu_defer_exit_bp' filepath='src/urcu-defer-impl.h' line='466' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_defer_exit_bp'>
      <!-- void -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- void rcu_defer_unregister_thread_bp() -->
    <function-decl name='rcu_defer_unregister_thread_bp' mangled-name='rcu_defer_unregister_thread_bp' filepath='src/urcu-defer-impl.h' line='448' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_defer_unregister_thread_bp'>
      <!-- void -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- int rcu_defer_register_thread_bp() -->
    <function-decl name='rcu_defer_register_thread_bp' mangled-name='rcu_defer_register_thread_bp' filepath='src/urcu-defer-impl.h' line='426' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_defer_register_thread_bp'>
      <!-- int -->
      <return type-id='type-id-1'/>
    </function-decl>
    <!-- void defer_rcu_bp(void (void*)*, void*) -->
    <function-decl name='defer_rcu_bp' mangled-name='defer_rcu_bp' filepath='src/urcu-defer-impl.h' line='395' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='defer_rcu_bp'>
      <!-- parameter of type 'void (void*)*' -->
      <parameter type-id='type-id-27' name='fct' filepath='src/urcu-defer-impl.h' line='395' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-25' name='p' filepath='src/urcu-defer-impl.h' line='395' column='1'/>
      <!-- void -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- void rcu_defer_barrier_bp() -->
    <function-decl name='rcu_defer_barrier_bp' mangled-name='rcu_defer_barrier_bp' filepath='src/urcu-defer-impl.h' line='281' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_defer_barrier_bp'>
      <!-- void -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- void rcu_defer_barrier_thread_bp() -->
    <function-decl name='rcu_defer_barrier_thread_bp' mangled-name='rcu_defer_barrier_thread_bp' filepath='src/urcu-defer-impl.h' line='261' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_defer_barrier_thread_bp'>
      <!-- void -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- void urcu_unregister_rculfhash_atfork_bp(urcu_atfork*) -->
    <function-decl name='urcu_unregister_rculfhash_atfork_bp' mangled-name='urcu_unregister_rculfhash_atfork_bp' filepath='src/urcu-call-rcu-impl.h' line='1011' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='urcu_unregister_rculfhash_atfork_bp'>
      <!-- parameter of type 'urcu_atfork*' -->
      <parameter type-id='type-id-30' name='atfork' filepath='src/urcu-call-rcu-impl.h' line='1011' column='1'/>
      <!-- void -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- void urcu_register_rculfhash_atfork_bp(urcu_atfork*) -->
    <function-decl name='urcu_register_rculfhash_atfork_bp' mangled-name='urcu_register_rculfhash_atfork_bp' filepath='src/urcu-call-rcu-impl.h' line='1001' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='urcu_register_rculfhash_atfork_bp'>
      <!-- parameter of type 'urcu_atfork*' -->
      <parameter type-id='type-id-30' name='atfork' filepath='src/urcu-call-rcu-impl.h' line='1011' column='1'/>
      <!-- void -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- void call_rcu_after_fork_child_bp() -->
    <function-decl name='call_rcu_after_fork_child_bp' mangled-name='call_rcu_after_fork_child_bp' filepath='src/urcu-call-rcu-impl.h' line='959' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='call_rcu_after_fork_child_bp'>
      <!-- void -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- void call_rcu_after_fork_parent_bp() -->
    <function-decl name='call_rcu_after_fork_parent_bp' mangled-name='call_rcu_after_fork_parent_bp' filepath='src/urcu-call-rcu-impl.h' line='937' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='call_rcu_after_fork_parent_bp'>
      <!-- void -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- void call_rcu_before_fork_bp() -->
    <function-decl name='call_rcu_before_fork_bp' mangled-name='call_rcu_before_fork_bp' filepath='src/urcu-call-rcu-impl.h' line='910' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='call_rcu_before_fork_bp'>
      <!-- void -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- void rcu_barrier_bp() -->
    <function-decl name='rcu_barrier_bp' mangled-name='rcu_barrier_bp' filepath='src/urcu-call-rcu-impl.h' line='839' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_barrier_bp'>
      <!-- void -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- void free_all_cpu_call_rcu_data_bp() -->
    <function-decl name='free_all_cpu_call_rcu_data_bp' mangled-name='free_all_cpu_call_rcu_data_bp' filepath='src/urcu-call-rcu-impl.h' line='776' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='free_all_cpu_call_rcu_data_bp'>
      <!-- void -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- struct call_rcu_data -->
    <class-decl name='call_rcu_data' size-in-bits='1024' is-struct='yes' visibility='default' filepath='src/urcu-call-rcu-impl.h' line='52' column='1' id='type-id-33'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_wfcq_tail call_rcu_data::cbs_tail -->
        <var-decl name='cbs_tail' type-id='type-id-34' visibility='default' filepath='src/urcu-call-rcu-impl.h' line='60' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- cds_wfcq_head call_rcu_data::cbs_head -->
        <var-decl name='cbs_head' type-id='type-id-35' visibility='default' filepath='src/urcu-call-rcu-impl.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- unsigned long int call_rcu_data::flags -->
        <var-decl name='flags' type-id='type-id-3' visibility='default' filepath='src/urcu-call-rcu-impl.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- int32_t call_rcu_data::futex -->
        <var-decl name='futex' type-id='type-id-36' visibility='default' filepath='src/urcu-call-rcu-impl.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- unsigned long int call_rcu_data::qlen -->
        <var-decl name='qlen' type-id='type-id-3' visibility='default' filepath='src/urcu-call-rcu-impl.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- pthread_t call_rcu_data::tid -->
        <var-decl name='tid' type-id='type-id-6' visibility='default' filepath='src/urcu-call-rcu-impl.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- int call_rcu_data::cpu_affinity -->
        <var-decl name='cpu_affinity' type-id='type-id-1' visibility='default' filepath='src/urcu-call-rcu-impl.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <!-- unsigned long int call_rcu_data::gp_count -->
        <var-decl name='gp_count' type-id='type-id-3' visibility='default' filepath='src/urcu-call-rcu-impl.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <!-- cds_list_head call_rcu_data::list -->
        <var-decl name='list' type-id='type-id-5' visibility='default' filepath='src/urcu-call-rcu-impl.h' line='68' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct cds_wfcq_tail -->
    <class-decl name='cds_wfcq_tail' size-in-bits='64' is-struct='yes' visibility='default' filepath='../include/urcu/wfcqueue.h' line='127' column='1' id='type-id-34'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_wfcq_node* cds_wfcq_tail::p -->
        <var-decl name='p' type-id='type-id-21' visibility='default' filepath='../include/urcu/wfcqueue.h' line='128' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct cds_wfcq_head -->
    <class-decl name='cds_wfcq_head' size-in-bits='384' is-struct='yes' visibility='default' filepath='../include/urcu/wfcqueue.h' line='72' column='1' id='type-id-35'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_wfcq_node cds_wfcq_head::node -->
        <var-decl name='node' type-id='type-id-19' visibility='default' filepath='../include/urcu/wfcqueue.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- pthread_mutex_t cds_wfcq_head::lock -->
        <var-decl name='lock' type-id='type-id-37' visibility='default' filepath='../include/urcu/wfcqueue.h' line='74' column='1'/>
      </data-member>
    </class-decl>
    <!-- union __anonymous_union__ -->
    <union-decl name='__anonymous_union__' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='67' column='1' id='type-id-38'>
      <data-member access='private'>
        <!-- __pthread_mutex_s __anonymous_union__::__data -->
        <var-decl name='__data' type-id='type-id-39' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='69' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char __anonymous_union__::__size[40] -->
        <var-decl name='__size' type-id='type-id-40' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='70' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- long int __anonymous_union__::__align -->
        <var-decl name='__align' type-id='type-id-41' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='71' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct __pthread_mutex_s -->
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='118' column='1' id='type-id-39'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int __pthread_mutex_s::__lock -->
        <var-decl name='__lock' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='120' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- unsigned int __pthread_mutex_s::__count -->
        <var-decl name='__count' type-id='type-id-42' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='121' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int __pthread_mutex_s::__owner -->
        <var-decl name='__owner' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='122' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- unsigned int __pthread_mutex_s::__nusers -->
        <var-decl name='__nusers' type-id='type-id-42' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='124' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int __pthread_mutex_s::__kind -->
        <var-decl name='__kind' type-id='type-id-1' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='148' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- short int __pthread_mutex_s::__spins -->
        <var-decl name='__spins' type-id='type-id-43' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <!-- short int __pthread_mutex_s::__elision -->
        <var-decl name='__elision' type-id='type-id-43' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='154' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- __pthread_list_t __pthread_mutex_s::__list -->
        <var-decl name='__list' type-id='type-id-44' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='155' column='1'/>
      </data-member>
    </class-decl>
    <!-- unsigned int -->
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-42'/>
    <!-- short int -->
    <type-decl name='short int' size-in-bits='16' id='type-id-43'/>
    <!-- struct __pthread_internal_list -->
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='82' column='1' id='type-id-45'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- __pthread_internal_list* __pthread_internal_list::__prev -->
        <var-decl name='__prev' type-id='type-id-46' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='84' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- __pthread_internal_list* __pthread_internal_list::__next -->
        <var-decl name='__next' type-id='type-id-46' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='85' column='1'/>
      </data-member>
    </class-decl>
    <!-- __pthread_internal_list* -->
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-46'/>
    <!-- typedef __pthread_internal_list __pthread_list_t -->
    <typedef-decl name='__pthread_list_t' type-id='type-id-45' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='86' column='1' id='type-id-44'/>
    <!-- char -->
    <type-decl name='char' size-in-bits='8' id='type-id-47'/>

    <!-- char[40] -->
    <array-type-def dimensions='1' type-id='type-id-47' size-in-bits='320' id='type-id-40'>
      <!-- <anonymous range>[40] -->
      <subrange length='40' type-id='type-id-3' id='type-id-48'/>

    </array-type-def>
    <!-- long int -->
    <type-decl name='long int' size-in-bits='64' id='type-id-41'/>
    <!-- typedef __anonymous_union__ pthread_mutex_t -->
    <typedef-decl name='pthread_mutex_t' type-id='type-id-38' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='72' column='1' id='type-id-37'/>
    <!-- typedef int __int32_t -->
    <typedef-decl name='__int32_t' type-id='type-id-1' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='40' column='1' id='type-id-49'/>
    <!-- typedef __int32_t int32_t -->
    <typedef-decl name='int32_t' type-id='type-id-49' filepath='/usr/include/x86_64-linux-gnu/bits/stdint-intn.h' line='26' column='1' id='type-id-36'/>
    <!-- call_rcu_data* -->
    <pointer-type-def type-id='type-id-33' size-in-bits='64' id='type-id-50'/>
    <!-- void call_rcu_data_free_bp(call_rcu_data*) -->
    <function-decl name='call_rcu_data_free_bp' mangled-name='call_rcu_data_free_bp' filepath='src/urcu-call-rcu-impl.h' line='744' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='call_rcu_data_free_bp'>
      <!-- parameter of type 'call_rcu_data*' -->
      <parameter type-id='type-id-50' name='crdp' filepath='src/urcu-call-rcu-impl.h' line='744' column='1'/>
      <!-- void -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- void call_rcu_bp(rcu_head*, void (rcu_head*)*) -->
    <function-decl name='call_rcu_bp' mangled-name='call_rcu_bp' filepath='src/urcu-call-rcu-impl.h' line='706' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='call_rcu_bp'>
      <!-- parameter of type 'rcu_head*' -->
      <parameter type-id='type-id-22' name='head' filepath='src/urcu-call-rcu-impl.h' line='706' column='1'/>
      <!-- parameter of type 'void (rcu_head*)*' -->
      <parameter type-id='type-id-20' name='func' filepath='src/urcu-call-rcu-impl.h' line='707' column='1'/>
      <!-- void -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- int create_all_cpu_call_rcu_data_bp(unsigned long int) -->
    <function-decl name='create_all_cpu_call_rcu_data_bp' mangled-name='create_all_cpu_call_rcu_data_bp' filepath='src/urcu-call-rcu-impl.h' line='628' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='create_all_cpu_call_rcu_data_bp'>
      <!-- parameter of type 'unsigned long int' -->
      <parameter type-id='type-id-3' name='flags' filepath='src/urcu-call-rcu-impl.h' line='628' column='1'/>
      <!-- int -->
      <return type-id='type-id-1'/>
    </function-decl>
    <!-- void set_thread_call_rcu_data_bp(call_rcu_data*) -->
    <function-decl name='set_thread_call_rcu_data_bp' mangled-name='set_thread_call_rcu_data_bp' filepath='src/urcu-call-rcu-impl.h' line='615' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='set_thread_call_rcu_data_bp'>
      <!-- parameter of type 'call_rcu_data*' -->
      <parameter type-id='type-id-50' name='crdp' filepath='src/urcu-call-rcu-impl.h' line='615' column='1'/>
      <!-- void -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- call_rcu_data* get_thread_call_rcu_data_bp() -->
    <function-decl name='get_thread_call_rcu_data_bp' mangled-name='get_thread_call_rcu_data_bp' filepath='src/urcu-call-rcu-impl.h' line='599' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_thread_call_rcu_data_bp'>
      <!-- call_rcu_data* -->
      <return type-id='type-id-50'/>
    </function-decl>
    <!-- call_rcu_data* get_call_rcu_data_bp() -->
    <function-decl name='get_call_rcu_data_bp' mangled-name='get_call_rcu_data_bp' filepath='src/urcu-call-rcu-impl.h' line='579' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_call_rcu_data_bp'>
      <!-- call_rcu_data* -->
      <return type-id='type-id-50'/>
    </function-decl>
    <!-- call_rcu_data* get_default_call_rcu_data_bp() -->
    <function-decl name='get_default_call_rcu_data_bp' mangled-name='get_default_call_rcu_data_bp' filepath='src/urcu-call-rcu-impl.h' line='554' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_default_call_rcu_data_bp'>
      <!-- call_rcu_data* -->
      <return type-id='type-id-50'/>
    </function-decl>
    <!-- int set_cpu_call_rcu_data_bp(int, call_rcu_data*) -->
    <function-decl name='set_cpu_call_rcu_data_bp' mangled-name='set_cpu_call_rcu_data_bp' filepath='src/urcu-call-rcu-impl.h' line='515' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='set_cpu_call_rcu_data_bp'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-1' name='cpu' filepath='src/urcu-call-rcu-impl.h' line='515' column='1'/>
      <!-- parameter of type 'call_rcu_data*' -->
      <parameter type-id='type-id-50' name='crdp' filepath='src/urcu-call-rcu-impl.h' line='515' column='1'/>
      <!-- int -->
      <return type-id='type-id-1'/>
    </function-decl>
    <!-- call_rcu_data* create_call_rcu_data_bp(unsigned long int, int) -->
    <function-decl name='create_call_rcu_data_bp' mangled-name='create_call_rcu_data_bp' filepath='src/urcu-call-rcu-impl.h' line='491' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='create_call_rcu_data_bp'>
      <!-- parameter of type 'unsigned long int' -->
      <parameter type-id='type-id-3' name='flags' filepath='src/urcu-call-rcu-impl.h' line='491' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-1' name='cpu_affinity' filepath='src/urcu-call-rcu-impl.h' line='492' column='1'/>
      <!-- call_rcu_data* -->
      <return type-id='type-id-50'/>
    </function-decl>
    <!-- pthread_t get_call_rcu_thread_bp(call_rcu_data*) -->
    <function-decl name='get_call_rcu_thread_bp' mangled-name='get_call_rcu_thread_bp' filepath='src/urcu-call-rcu-impl.h' line='473' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_call_rcu_thread_bp'>
      <!-- parameter of type 'call_rcu_data*' -->
      <parameter type-id='type-id-50' name='crdp' filepath='src/urcu-call-rcu-impl.h' line='473' column='1'/>
      <!-- typedef pthread_t -->
      <return type-id='type-id-6'/>
    </function-decl>
    <!-- call_rcu_data* get_cpu_call_rcu_data_bp(int) -->
    <function-decl name='get_cpu_call_rcu_data_bp' mangled-name='get_cpu_call_rcu_data_bp' filepath='src/urcu-call-rcu-impl.h' line='451' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_cpu_call_rcu_data_bp'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-1' name='cpu' filepath='src/urcu-call-rcu-impl.h' line='451' column='1'/>
      <!-- call_rcu_data* -->
      <return type-id='type-id-50'/>
    </function-decl>
    <!-- void** -->
    <pointer-type-def type-id='type-id-25' size-in-bits='64' id='type-id-51'/>
    <!-- void* rcu_cmpxchg_pointer_sym_bp(void**, void*, void*) -->
    <function-decl name='rcu_cmpxchg_pointer_sym_bp' mangled-name='rcu_cmpxchg_pointer_sym_bp' filepath='src/urcu-bp.c' line='732' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_cmpxchg_pointer_sym_bp'>
      <!-- parameter of type 'void**' -->
      <parameter type-id='type-id-51' name='p' filepath='src/urcu-bp.c' line='732' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-25' name='old' filepath='src/urcu-bp.c' line='732' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-25' name='_new' filepath='src/urcu-bp.c' line='732' column='1'/>
      <!-- void* -->
      <return type-id='type-id-25'/>
    </function-decl>
    <!-- void* rcu_xchg_pointer_sym_bp(void**, void*) -->
    <function-decl name='rcu_xchg_pointer_sym_bp' mangled-name='rcu_xchg_pointer_sym_bp' filepath='src/urcu-bp.c' line='726' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_xchg_pointer_sym_bp'>
      <!-- parameter of type 'void**' -->
      <parameter type-id='type-id-51' name='p' filepath='src/urcu-bp.c' line='726' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-25' name='v' filepath='src/urcu-bp.c' line='726' column='1'/>
      <!-- void* -->
      <return type-id='type-id-25'/>
    </function-decl>
    <!-- void* rcu_set_pointer_sym_bp(void**, void*) -->
    <function-decl name='rcu_set_pointer_sym_bp' mangled-name='rcu_set_pointer_sym_bp' filepath='src/urcu-bp.c' line='719' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_set_pointer_sym_bp'>
      <!-- parameter of type 'void**' -->
      <parameter type-id='type-id-51' name='p' filepath='src/urcu-bp.c' line='719' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-25' name='v' filepath='src/urcu-bp.c' line='719' column='1'/>
      <!-- void* -->
      <return type-id='type-id-25'/>
    </function-decl>
    <!-- void* rcu_dereference_sym_bp(void*) -->
    <function-decl name='rcu_dereference_sym_bp' mangled-name='rcu_dereference_sym_bp' filepath='src/urcu-bp.c' line='714' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_dereference_sym_bp'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-25' name='p' filepath='src/urcu-bp.c' line='714' column='1'/>
      <!-- void* -->
      <return type-id='type-id-25'/>
    </function-decl>
    <!-- void rcu_bp_after_fork_child() -->
    <function-decl name='rcu_bp_after_fork_child' mangled-name='rcu_bp_after_fork_child' filepath='src/urcu-bp.c' line='701' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_bp_after_fork_child'>
      <!-- void -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- void rcu_bp_after_fork_parent() -->
    <function-decl name='rcu_bp_after_fork_parent' mangled-name='rcu_bp_after_fork_parent' filepath='src/urcu-bp.c' line='666' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_bp_after_fork_parent'>
      <!-- void -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- void rcu_bp_before_fork() -->
    <function-decl name='rcu_bp_before_fork' mangled-name='rcu_bp_before_fork' filepath='src/urcu-bp.c' line='652' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_bp_before_fork'>
      <!-- void -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- void rcu_bp_register() -->
    <function-decl name='rcu_bp_register' mangled-name='rcu_bp_register' filepath='src/urcu-bp.c' line='519' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_bp_register'>
      <!-- void -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- int rcu_read_ongoing_bp() -->
    <function-decl name='rcu_read_ongoing_bp' mangled-name='rcu_read_ongoing_bp' filepath='src/urcu-bp.c' line='352' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_read_ongoing_bp'>
      <!-- int -->
      <return type-id='type-id-1'/>
    </function-decl>
    <!-- void rcu_read_unlock_bp() -->
    <function-decl name='rcu_read_unlock_bp' mangled-name='rcu_read_unlock_bp' filepath='src/urcu-bp.c' line='347' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_read_unlock_bp'>
      <!-- void -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- void rcu_read_lock_bp() -->
    <function-decl name='rcu_read_lock_bp' mangled-name='rcu_read_lock_bp' filepath='src/urcu-bp.c' line='342' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_read_lock_bp'>
      <!-- void -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- void synchronize_rcu_bp() -->
    <function-decl name='synchronize_rcu_bp' mangled-name='synchronize_rcu_bp' filepath='src/urcu-bp.c' line='259' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='synchronize_rcu_bp'>
      <!-- void -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- int () -->
    <function-type size-in-bits='64' id='type-id-17'>
      <!-- int -->
      <return type-id='type-id-1'/>
    </function-type>
    <!-- void () -->
    <function-type size-in-bits='64' id='type-id-16'>
      <!-- void -->
      <return type-id='type-id-15'/>
    </function-type>
    <!-- void (rcu_head*) -->
    <function-type size-in-bits='64' id='type-id-23'>
      <!-- parameter of type 'rcu_head*' -->
      <parameter type-id='type-id-22'/>
      <!-- void -->
      <return type-id='type-id-15'/>
    </function-type>
    <!-- void (rcu_head*, void (rcu_head*)*) -->
    <function-type size-in-bits='64' id='type-id-24'>
      <!-- parameter of type 'rcu_head*' -->
      <parameter type-id='type-id-22'/>
      <!-- parameter of type 'void (rcu_head*)*' -->
      <parameter type-id='type-id-20'/>
      <!-- void -->
      <return type-id='type-id-15'/>
    </function-type>
    <!-- void (urcu_atfork*) -->
    <function-type size-in-bits='64' id='type-id-31'>
      <!-- parameter of type 'urcu_atfork*' -->
      <parameter type-id='type-id-30'/>
      <!-- void -->
      <return type-id='type-id-15'/>
    </function-type>
    <!-- void (void (void*)*, void*) -->
    <function-type size-in-bits='64' id='type-id-28'>
      <!-- parameter of type 'void (void*)*' -->
      <parameter type-id='type-id-27'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-25'/>
      <!-- void -->
      <return type-id='type-id-15'/>
    </function-type>
    <!-- void (void*) -->
    <function-type size-in-bits='64' id='type-id-26'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-25'/>
      <!-- void -->
      <return type-id='type-id-15'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='urcu-pointer.c' comp-dir-path='src' language='LANG_C99'>
    <!-- void* rcu_cmpxchg_pointer_sym(void**, void*, void*) -->
    <function-decl name='rcu_cmpxchg_pointer_sym' mangled-name='rcu_cmpxchg_pointer_sym' filepath='src/urcu-pointer.c' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_cmpxchg_pointer_sym'>
      <!-- parameter of type 'void**' -->
      <parameter type-id='type-id-51' name='p' filepath='src/urcu-bp.c' line='732' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-25' name='old' filepath='src/urcu-bp.c' line='732' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-25' name='_new' filepath='src/urcu-bp.c' line='732' column='1'/>
      <!-- void* -->
      <return type-id='type-id-25'/>
    </function-decl>
    <!-- void* rcu_xchg_pointer_sym(void**, void*) -->
    <function-decl name='rcu_xchg_pointer_sym' mangled-name='rcu_xchg_pointer_sym' filepath='src/urcu-pointer.c' line='47' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_xchg_pointer_sym'>
      <!-- parameter of type 'void**' -->
      <parameter type-id='type-id-51' name='p' filepath='src/urcu-bp.c' line='726' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-25' name='v' filepath='src/urcu-bp.c' line='726' column='1'/>
      <!-- void* -->
      <return type-id='type-id-25'/>
    </function-decl>
    <!-- void* rcu_set_pointer_sym(void**, void*) -->
    <function-decl name='rcu_set_pointer_sym' mangled-name='rcu_set_pointer_sym' filepath='src/urcu-pointer.c' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_set_pointer_sym'>
      <!-- parameter of type 'void**' -->
      <parameter type-id='type-id-51' name='p' filepath='src/urcu-bp.c' line='719' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-25' name='v' filepath='src/urcu-bp.c' line='719' column='1'/>
      <!-- void* -->
      <return type-id='type-id-25'/>
    </function-decl>
    <!-- void* rcu_dereference_sym(void*) -->
    <function-decl name='rcu_dereference_sym' mangled-name='rcu_dereference_sym' filepath='src/urcu-pointer.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_dereference_sym'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-25' name='p' filepath='src/urcu-bp.c' line='714' column='1'/>
      <!-- void* -->
      <return type-id='type-id-25'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='compat_futex.c' comp-dir-path='src' language='LANG_C99'>
    <!-- pthread_mutex_t __urcu_compat_futex_lock -->
    <var-decl name='__urcu_compat_futex_lock' type-id='type-id-37' mangled-name='__urcu_compat_futex_lock' visibility='default' filepath='src/compat_futex.c' line='44' column='1' elf-symbol-id='__urcu_compat_futex_lock'/>
    <!-- union __anonymous_union__ -->
    <union-decl name='__anonymous_union__' size-in-bits='384' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='75' column='1' id='type-id-52'>
      <data-member access='private'>
        <!-- __pthread_cond_s __anonymous_union__::__data -->
        <var-decl name='__data' type-id='type-id-53' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='77' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char __anonymous_union__::__size[48] -->
        <var-decl name='__size' type-id='type-id-54' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='78' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- long long int __anonymous_union__::__align -->
        <var-decl name='__align' type-id='type-id-55' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='79' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct __pthread_cond_s -->
    <class-decl name='__pthread_cond_s' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='171' column='1' id='type-id-53'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- __anonymous_union__  -->
        <var-decl name='' type-id='type-id-56' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- unsigned int __pthread_cond_s::__g_refs[2] -->
        <var-decl name='__g_refs' type-id='type-id-57' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='191' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- unsigned int __pthread_cond_s::__g_size[2] -->
        <var-decl name='__g_size' type-id='type-id-57' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='192' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- unsigned int __pthread_cond_s::__g1_orig_size -->
        <var-decl name='__g1_orig_size' type-id='type-id-42' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='193' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- unsigned int __pthread_cond_s::__wrefs -->
        <var-decl name='__wrefs' type-id='type-id-42' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='194' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- unsigned int __pthread_cond_s::__g_signals[2] -->
        <var-decl name='__g_signals' type-id='type-id-57' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='195' column='1'/>
      </data-member>
    </class-decl>
    <!-- union __anonymous_union__ -->
    <union-decl name='__anonymous_union__' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='173' column='1' id='type-id-56'>
      <data-member access='private'>
        <!-- long long unsigned int __anonymous_union__::__wseq -->
        <var-decl name='__wseq' type-id='type-id-58' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='175' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- __anonymous_struct__ __anonymous_union__::__wseq32 -->
        <var-decl name='__wseq32' type-id='type-id-59' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='180' column='1'/>
      </data-member>
    </union-decl>
    <!-- long long unsigned int -->
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-58'/>
    <!-- struct __anonymous_struct__ -->
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='176' column='1' id='type-id-59'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned int __anonymous_struct__::__low -->
        <var-decl name='__low' type-id='type-id-42' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='178' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- unsigned int __anonymous_struct__::__high -->
        <var-decl name='__high' type-id='type-id-42' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/thread-shared-types.h' line='179' column='1'/>
      </data-member>
    </class-decl>

    <!-- unsigned int[2] -->
    <array-type-def dimensions='1' type-id='type-id-42' size-in-bits='64' id='type-id-57'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' type-id='type-id-3' id='type-id-60'/>

    </array-type-def>

    <!-- char[48] -->
    <array-type-def dimensions='1' type-id='type-id-47' size-in-bits='384' id='type-id-54'>
      <!-- <anonymous range>[48] -->
      <subrange length='48' type-id='type-id-3' id='type-id-61'/>

    </array-type-def>
    <!-- long long int -->
    <type-decl name='long long int' size-in-bits='64' id='type-id-55'/>
    <!-- typedef __anonymous_union__ pthread_cond_t -->
    <typedef-decl name='pthread_cond_t' type-id='type-id-52' filepath='/usr/include/x86_64-linux-gnu/bits/pthreadtypes.h' line='80' column='1' id='type-id-62'/>
    <!-- pthread_cond_t __urcu_compat_futex_cond -->
    <var-decl name='__urcu_compat_futex_cond' type-id='type-id-62' mangled-name='__urcu_compat_futex_cond' visibility='default' filepath='src/compat_futex.c' line='46' column='1' elf-symbol-id='__urcu_compat_futex_cond'/>
    <!-- int32_t* -->
    <pointer-type-def type-id='type-id-36' size-in-bits='64' id='type-id-63'/>
    <!-- struct timespec -->
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h' line='9' column='1' id='type-id-64'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- __time_t timespec::tv_sec -->
        <var-decl name='tv_sec' type-id='type-id-65' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h' line='11' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- __syscall_slong_t timespec::tv_nsec -->
        <var-decl name='tv_nsec' type-id='type-id-66' visibility='default' filepath='/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h' line='12' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef long int __time_t -->
    <typedef-decl name='__time_t' type-id='type-id-41' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='148' column='1' id='type-id-65'/>
    <!-- typedef long int __syscall_slong_t -->
    <typedef-decl name='__syscall_slong_t' type-id='type-id-41' filepath='/usr/include/x86_64-linux-gnu/bits/types.h' line='184' column='1' id='type-id-66'/>
    <!-- const timespec -->
    <qualified-type-def type-id='type-id-64' const='yes' id='type-id-67'/>
    <!-- const timespec* -->
    <pointer-type-def type-id='type-id-67' size-in-bits='64' id='type-id-68'/>
    <!-- int compat_futex_async(int32_t*, int, int32_t, const timespec*, int32_t*, int32_t) -->
    <function-decl name='compat_futex_async' mangled-name='compat_futex_async' filepath='src/compat_futex.c' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='compat_futex_async'>
      <!-- parameter of type 'int32_t*' -->
      <parameter type-id='type-id-63' name='uaddr' filepath='src/compat_futex.c' line='118' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-1' name='op' filepath='src/compat_futex.c' line='118' column='1'/>
      <!-- parameter of type 'typedef int32_t' -->
      <parameter type-id='type-id-36' name='val' filepath='src/compat_futex.c' line='118' column='1'/>
      <!-- parameter of type 'const timespec*' -->
      <parameter type-id='type-id-68' name='timeout' filepath='src/compat_futex.c' line='119' column='1'/>
      <!-- parameter of type 'int32_t*' -->
      <parameter type-id='type-id-63' name='uaddr2' filepath='src/compat_futex.c' line='119' column='1'/>
      <!-- parameter of type 'typedef int32_t' -->
      <parameter type-id='type-id-36' name='val3' filepath='src/compat_futex.c' line='119' column='1'/>
      <!-- int -->
      <return type-id='type-id-1'/>
    </function-decl>
    <!-- int compat_futex_noasync(int32_t*, int, int32_t, const timespec*, int32_t*, int32_t) -->
    <function-decl name='compat_futex_noasync' mangled-name='compat_futex_noasync' filepath='src/compat_futex.c' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='compat_futex_noasync'>
      <!-- parameter of type 'int32_t*' -->
      <parameter type-id='type-id-63' name='uaddr' filepath='src/compat_futex.c' line='54' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-1' name='op' filepath='src/compat_futex.c' line='54' column='1'/>
      <!-- parameter of type 'typedef int32_t' -->
      <parameter type-id='type-id-36' name='val' filepath='src/compat_futex.c' line='54' column='1'/>
      <!-- parameter of type 'const timespec*' -->
      <parameter type-id='type-id-68' name='timeout' filepath='src/compat_futex.c' line='55' column='1'/>
      <!-- parameter of type 'int32_t*' -->
      <parameter type-id='type-id-63' name='uaddr2' filepath='src/compat_futex.c' line='55' column='1'/>
      <!-- parameter of type 'typedef int32_t' -->
      <parameter type-id='type-id-36' name='val3' filepath='src/compat_futex.c' line='55' column='1'/>
      <!-- int -->
      <return type-id='type-id-1'/>
    </function-decl>
  </abi-instr>
</abi-corpus>
