<abi-corpus architecture='elf-amd-x86_64' soname='liburcu-qsbr.so.6'>
  <elf-needed>
    <dependency name='liburcu-common.so.6'/>
    <dependency name='libpthread.so.0'/>
    <dependency name='libc.so.6'/>
    <dependency name='ld-linux-x86-64.so.2'/>
  </elf-needed>
  <elf-function-symbols>
    <!-- call_rcu_after_fork_child_qsbr -->
    <elf-symbol name='call_rcu_after_fork_child_qsbr' type='func-type' binding='global-binding' visibility='default-visibility' alias='urcu_qsbr_call_rcu_after_fork_child' is-defined='yes'/>
    <!-- call_rcu_after_fork_parent_qsbr -->
    <elf-symbol name='call_rcu_after_fork_parent_qsbr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- call_rcu_before_fork_qsbr -->
    <elf-symbol name='call_rcu_before_fork_qsbr' type='func-type' binding='global-binding' visibility='default-visibility' alias='urcu_qsbr_call_rcu_before_fork' is-defined='yes'/>
    <!-- call_rcu_data_free_qsbr -->
    <elf-symbol name='call_rcu_data_free_qsbr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- call_rcu_qsbr -->
    <elf-symbol name='call_rcu_qsbr' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- compat_futex_async -->
    <elf-symbol name='compat_futex_async' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- compat_futex_noasync -->

    <elf-symbol name='urcu_qsbr_get_thread_call_rcu_data' type='func-type' binding='global-binding' visibility='default-visibility' alias='get_thread_call_rcu_data_qsbr' is-defined='yes'/>
    <!-- urcu_qsbr_quiescent_state -->
    <elf-symbol name='urcu_qsbr_quiescent_state' type='func-type' binding='global-binding' visibility='default-visibility' alias='rcu_quiescent_state_qsbr' is-defined='yes'/>
    <!-- urcu_qsbr_read_lock -->
    <elf-symbol name='urcu_qsbr_read_lock' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- urcu_qsbr_read_ongoing -->
    <elf-symbol name='urcu_qsbr_read_ongoing' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- urcu_qsbr_read_unlock -->
    <elf-symbol name='urcu_qsbr_read_unlock' type='func-type' binding='global-binding' visibility='default-visibility' alias='rcu_read_unlock_qsbr' is-defined='yes'/>
    <!-- urcu_qsbr_register_rculfhash_atfork -->
    <elf-symbol name='urcu_qsbr_register_rculfhash_atfork' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- urcu_qsbr_register_thread -->
    <elf-symbol name='urcu_qsbr_register_thread' type='func-type' binding='global-binding' visibility='default-visibility' alias='rcu_register_thread_qsbr' is-defined='yes'/>
    <!-- urcu_qsbr_set_cpu_call_rcu_data -->
    <elf-symbol name='urcu_qsbr_set_cpu_call_rcu_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- urcu_qsbr_set_thread_call_rcu_data -->
    <elf-symbol name='urcu_qsbr_set_thread_call_rcu_data' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- urcu_qsbr_synchronize_rcu -->
    <elf-symbol name='urcu_qsbr_synchronize_rcu' type='func-type' binding='global-binding' visibility='default-visibility' alias='synchronize_rcu_qsbr' is-defined='yes'/>
    <!-- urcu_qsbr_thread_offline -->
    <elf-symbol name='urcu_qsbr_thread_offline' type='func-type' binding='global-binding' visibility='default-visibility' alias='rcu_thread_offline_qsbr' is-defined='yes'/>
    <!-- urcu_qsbr_thread_online -->
    <elf-symbol name='urcu_qsbr_thread_online' type='func-type' binding='global-binding' visibility='default-visibility' alias='rcu_thread_online_qsbr' is-defined='yes'/>
    <!-- urcu_qsbr_unregister_rculfhash_atfork -->
    <elf-symbol name='urcu_qsbr_unregister_rculfhash_atfork' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- urcu_qsbr_unregister_thread -->
    <elf-symbol name='urcu_qsbr_unregister_thread' type='func-type' binding='global-binding' visibility='default-visibility' alias='rcu_unregister_thread_qsbr' is-defined='yes'/>
    <!-- urcu_register_rculfhash_atfork_qsbr -->
    <elf-symbol name='urcu_register_rculfhash_atfork_qsbr' type='func-type' binding='global-binding' visibility='default-visibility' alias='urcu_qsbr_register_rculfhash_atfork' is-defined='yes'/>
    <!-- urcu_unregister_rculfhash_atfork_qsbr -->
    <elf-symbol name='urcu_unregister_rculfhash_atfork_qsbr' type='func-type' binding='global-binding' visibility='default-visibility' alias='urcu_qsbr_unregister_rculfhash_atfork' is-defined='yes'/>
  </elf-function-symbols>
  <elf-variable-symbols>
    <!-- __urcu_compat_futex_cond -->
    <elf-symbol name='__urcu_compat_futex_cond' size='48' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- __urcu_compat_futex_lock -->
    <elf-symbol name='__urcu_compat_futex_lock' size='40' type='object-type' binding='weak-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_flavor_qsbr -->
    <elf-symbol name='rcu_flavor_qsbr' size='112' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- rcu_gp_qsbr -->
    <elf-symbol name='rcu_gp_qsbr' size='128' type='object-type' binding='global-binding' visibility='default-visibility' alias='urcu_qsbr_gp' is-defined='yes'/>
    <!-- rcu_reader_qsbr -->
    <elf-symbol name='rcu_reader_qsbr' size='256' type='tls-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- urcu_qsbr_flavor -->
    <elf-symbol name='urcu_qsbr_flavor' size='112' type='object-type' binding='global-binding' visibility='default-visibility' alias='rcu_flavor_qsbr' is-defined='yes'/>
    <!-- urcu_qsbr_gp -->
    <elf-symbol name='urcu_qsbr_gp' size='128' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes'/>
    <!-- urcu_qsbr_reader -->
    <elf-symbol name='urcu_qsbr_reader' size='256' type='tls-type' binding='global-binding' visibility='default-visibility' alias='rcu_reader_qsbr' is-defined='yes'/>
  </elf-variable-symbols>
  <abi-instr version='1.0' address-size='64' path='urcu-qsbr.c' comp-dir-path='src' language='LANG_C99'>

    <!-- char -->
    <type-decl name='char' size-in-bits='8' id='type-id-1'/>
    <!-- char[40] -->
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='320' id='type-id-2'>
      <!-- <anonymous range>[40] -->
      <subrange length='40' type-id='type-id-3' id='type-id-4'/>

    </array-type-def>
    <!-- int -->
    <type-decl name='int' size-in-bits='32' id='type-id-5'/>
    <!-- long int -->
    <type-decl name='long int' size-in-bits='64' id='type-id-6'/>
    <!-- short int -->
    <type-decl name='short int' size-in-bits='16' id='type-id-7'/>
    <!-- unsigned int -->
    <type-decl name='unsigned int' size-in-bits='32' id='type-id-8'/>
    <!-- unsigned long int -->
    <type-decl name='unsigned long int' size-in-bits='64' id='type-id-3'/>
    <!-- void -->
    <type-decl name='void' id='type-id-9'/>
    <!-- struct urcu_gp -->
    <class-decl name='urcu_gp' size-in-bits='1024' is-struct='yes' visibility='default' filepath='../include/urcu/static/urcu-common.h' line='67' column='1' id='type-id-10'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned long int urcu_gp::ctr -->
        <var-decl name='ctr' type-id='type-id-3' visibility='default' filepath='../include/urcu/static/urcu-common.h' line='75' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int32_t urcu_gp::futex -->
        <var-decl name='futex' type-id='type-id-11' visibility='default' filepath='../include/urcu/static/urcu-common.h' line='77' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef __int32_t int32_t -->
    <typedef-decl name='int32_t' type-id='type-id-12' filepath='/usr/include/bits/stdint-intn.h' line='26' column='1' id='type-id-11'/>
    <!-- typedef int __int32_t -->
    <typedef-decl name='__int32_t' type-id='type-id-5' filepath='/usr/include/bits/types.h' line='41' column='1' id='type-id-12'/>
    <!-- struct urcu_qsbr_reader -->
    <class-decl name='urcu_qsbr_reader' size-in-bits='2048' is-struct='yes' visibility='default' filepath='../include/urcu/static/urcu-qsbr.h' line='65' column='1' id='type-id-13'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned long int urcu_qsbr_reader::ctr -->
        <var-decl name='ctr' type-id='type-id-3' visibility='default' filepath='../include/urcu/static/urcu-qsbr.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1024'>
        <!-- cds_list_head urcu_qsbr_reader::node -->
        <var-decl name='node' type-id='type-id-14' visibility='default' filepath='../include/urcu/static/urcu-qsbr.h' line='69' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1152'>
        <!-- int urcu_qsbr_reader::waiting -->
        <var-decl name='waiting' type-id='type-id-5' visibility='default' filepath='../include/urcu/static/urcu-qsbr.h' line='70' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='1216'>
        <!-- pthread_t urcu_qsbr_reader::tid -->
        <var-decl name='tid' type-id='type-id-15' visibility='default' filepath='../include/urcu/static/urcu-qsbr.h' line='71' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='31'>
        <!-- unsigned int urcu_qsbr_reader::registered -->
        <var-decl name='registered' type-id='type-id-8' visibility='default' filepath='../include/urcu/static/urcu-qsbr.h' line='73' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct cds_list_head -->
    <class-decl name='cds_list_head' size-in-bits='128' is-struct='yes' visibility='default' filepath='../include/urcu/list.h' line='37' column='1' id='type-id-14'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_list_head* cds_list_head::next -->
        <var-decl name='next' type-id='type-id-16' visibility='default' filepath='../include/urcu/list.h' line='38' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- cds_list_head* cds_list_head::prev -->
        <var-decl name='prev' type-id='type-id-16' visibility='default' filepath='../include/urcu/list.h' line='38' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef unsigned long int pthread_t -->
    <typedef-decl name='pthread_t' type-id='type-id-3' filepath='/usr/include/bits/pthreadtypes.h' line='27' column='1' id='type-id-15'/>
    <!-- struct rcu_flavor_struct -->
    <class-decl name='rcu_flavor_struct' size-in-bits='896' is-struct='yes' visibility='default' filepath='../include/urcu/flavor.h' line='42' column='1' id='type-id-17'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void ()* rcu_flavor_struct::read_lock -->
        <var-decl name='read_lock' type-id='type-id-18' visibility='default' filepath='../include/urcu/flavor.h' line='43' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void ()* rcu_flavor_struct::read_unlock -->
        <var-decl name='read_unlock' type-id='type-id-18' visibility='default' filepath='../include/urcu/flavor.h' line='44' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int ()* rcu_flavor_struct::read_ongoing -->
        <var-decl name='read_ongoing' type-id='type-id-19' visibility='default' filepath='../include/urcu/flavor.h' line='45' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- void ()* rcu_flavor_struct::read_quiescent_state -->
        <var-decl name='read_quiescent_state' type-id='type-id-18' visibility='default' filepath='../include/urcu/flavor.h' line='46' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- void (rcu_head*, void (rcu_head*)*)* rcu_flavor_struct::update_call_rcu -->
        <var-decl name='update_call_rcu' type-id='type-id-20' visibility='default' filepath='../include/urcu/flavor.h' line='47' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- void ()* rcu_flavor_struct::update_synchronize_rcu -->
        <var-decl name='update_synchronize_rcu' type-id='type-id-18' visibility='default' filepath='../include/urcu/flavor.h' line='49' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='384'>
        <!-- void (void (void*)*, void*)* rcu_flavor_struct::update_defer_rcu -->
        <var-decl name='update_defer_rcu' type-id='type-id-21' visibility='default' filepath='../include/urcu/flavor.h' line='50' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- void ()* rcu_flavor_struct::thread_offline -->
        <var-decl name='thread_offline' type-id='type-id-18' visibility='default' filepath='../include/urcu/flavor.h' line='52' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- void ()* rcu_flavor_struct::thread_online -->
        <var-decl name='thread_online' type-id='type-id-18' visibility='default' filepath='../include/urcu/flavor.h' line='53' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- void ()* rcu_flavor_struct::register_thread -->
        <var-decl name='register_thread' type-id='type-id-18' visibility='default' filepath='../include/urcu/flavor.h' line='54' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- void ()* rcu_flavor_struct::unregister_thread -->
        <var-decl name='unregister_thread' type-id='type-id-18' visibility='default' filepath='../include/urcu/flavor.h' line='55' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- void ()* rcu_flavor_struct::barrier -->
        <var-decl name='barrier' type-id='type-id-18' visibility='default' filepath='../include/urcu/flavor.h' line='57' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <!-- void (urcu_atfork*)* rcu_flavor_struct::register_rculfhash_atfork -->
        <var-decl name='register_rculfhash_atfork' type-id='type-id-22' visibility='default' filepath='../include/urcu/flavor.h' line='59' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <!-- void (urcu_atfork*)* rcu_flavor_struct::unregister_rculfhash_atfork -->
        <var-decl name='unregister_rculfhash_atfork' type-id='type-id-22' visibility='default' filepath='../include/urcu/flavor.h' line='60' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct rcu_head -->
    <class-decl name='rcu_head' size-in-bits='128' is-struct='yes' visibility='default' filepath='../include/urcu/call-rcu.h' line='57' column='1' id='type-id-23'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_wfcq_node rcu_head::next -->
        <var-decl name='next' type-id='type-id-24' visibility='default' filepath='../include/urcu/call-rcu.h' line='58' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void (rcu_head*)* rcu_head::func -->
        <var-decl name='func' type-id='type-id-25' visibility='default' filepath='../include/urcu/call-rcu.h' line='59' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct cds_wfcq_node -->
    <class-decl name='cds_wfcq_node' size-in-bits='64' is-struct='yes' visibility='default' filepath='../include/urcu/wfcqueue.h' line='59' column='1' id='type-id-24'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_wfcq_node* cds_wfcq_node::next -->
        <var-decl name='next' type-id='type-id-26' visibility='default' filepath='../include/urcu/wfcqueue.h' line='60' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct urcu_atfork -->
    <class-decl name='urcu_atfork' size-in-bits='256' is-struct='yes' visibility='default' filepath='../include/urcu/flavor.h' line='32' column='1' id='type-id-27'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- void (void*)* urcu_atfork::before_fork -->
        <var-decl name='before_fork' type-id='type-id-28' visibility='default' filepath='../include/urcu/flavor.h' line='33' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- void (void*)* urcu_atfork::after_fork_parent -->
        <var-decl name='after_fork_parent' type-id='type-id-28' visibility='default' filepath='../include/urcu/flavor.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- void (void*)* urcu_atfork::after_fork_child -->
        <var-decl name='after_fork_child' type-id='type-id-28' visibility='default' filepath='../include/urcu/flavor.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- void* urcu_atfork::priv -->
        <var-decl name='priv' type-id='type-id-29' visibility='default' filepath='../include/urcu/flavor.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct call_rcu_data -->
    <class-decl name='call_rcu_data' size-in-bits='1024' is-struct='yes' visibility='default' filepath='src/urcu-call-rcu-impl.h' line='53' column='1' id='type-id-30'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_wfcq_tail call_rcu_data::cbs_tail -->
        <var-decl name='cbs_tail' type-id='type-id-31' visibility='default' filepath='src/urcu-call-rcu-impl.h' line='61' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- cds_wfcq_head call_rcu_data::cbs_head -->
        <var-decl name='cbs_head' type-id='type-id-32' visibility='default' filepath='src/urcu-call-rcu-impl.h' line='62' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='448'>
        <!-- unsigned long int call_rcu_data::flags -->
        <var-decl name='flags' type-id='type-id-3' visibility='default' filepath='src/urcu-call-rcu-impl.h' line='63' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='512'>
        <!-- int32_t call_rcu_data::futex -->
        <var-decl name='futex' type-id='type-id-11' visibility='default' filepath='src/urcu-call-rcu-impl.h' line='64' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='576'>
        <!-- unsigned long int call_rcu_data::qlen -->
        <var-decl name='qlen' type-id='type-id-3' visibility='default' filepath='src/urcu-call-rcu-impl.h' line='65' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='640'>
        <!-- pthread_t call_rcu_data::tid -->
        <var-decl name='tid' type-id='type-id-15' visibility='default' filepath='src/urcu-call-rcu-impl.h' line='66' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='704'>
        <!-- int call_rcu_data::cpu_affinity -->
        <var-decl name='cpu_affinity' type-id='type-id-5' visibility='default' filepath='src/urcu-call-rcu-impl.h' line='67' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='768'>
        <!-- unsigned long int call_rcu_data::gp_count -->
        <var-decl name='gp_count' type-id='type-id-3' visibility='default' filepath='src/urcu-call-rcu-impl.h' line='68' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='832'>
        <!-- cds_list_head call_rcu_data::list -->
        <var-decl name='list' type-id='type-id-14' visibility='default' filepath='src/urcu-call-rcu-impl.h' line='69' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct cds_wfcq_tail -->
    <class-decl name='cds_wfcq_tail' size-in-bits='64' is-struct='yes' visibility='default' filepath='../include/urcu/wfcqueue.h' line='127' column='1' id='type-id-31'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_wfcq_node* cds_wfcq_tail::p -->
        <var-decl name='p' type-id='type-id-26' visibility='default' filepath='../include/urcu/wfcqueue.h' line='128' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct cds_wfcq_head -->
    <class-decl name='cds_wfcq_head' size-in-bits='384' is-struct='yes' visibility='default' filepath='../include/urcu/wfcqueue.h' line='72' column='1' id='type-id-32'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- cds_wfcq_node cds_wfcq_head::node -->
        <var-decl name='node' type-id='type-id-24' visibility='default' filepath='../include/urcu/wfcqueue.h' line='73' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- pthread_mutex_t cds_wfcq_head::lock -->
        <var-decl name='lock' type-id='type-id-33' visibility='default' filepath='../include/urcu/wfcqueue.h' line='74' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef __anonymous_union__ pthread_mutex_t -->
    <typedef-decl name='pthread_mutex_t' type-id='type-id-34' filepath='/usr/include/bits/pthreadtypes.h' line='72' column='1' id='type-id-33'/>
    <!-- union {__pthread_mutex_s __data; char __size[40]; long int __align;} -->
    <union-decl name='__anonymous_union__' size-in-bits='320' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='67' column='1' id='type-id-34'>
      <data-member access='private'>
        <!-- __pthread_mutex_s __data -->
        <var-decl name='__data' type-id='type-id-35' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='69' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char __size[40] -->
        <var-decl name='__size' type-id='type-id-2' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='70' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- long int __align -->
        <var-decl name='__align' type-id='type-id-6' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='71' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct __pthread_mutex_s -->
    <class-decl name='__pthread_mutex_s' size-in-bits='320' is-struct='yes' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='22' column='1' id='type-id-35'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- int __pthread_mutex_s::__lock -->
        <var-decl name='__lock' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='24' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- unsigned int __pthread_mutex_s::__count -->
        <var-decl name='__count' type-id='type-id-8' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='25' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- int __pthread_mutex_s::__owner -->
        <var-decl name='__owner' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='26' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='96'>
        <!-- unsigned int __pthread_mutex_s::__nusers -->
        <var-decl name='__nusers' type-id='type-id-8' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='28' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- int __pthread_mutex_s::__kind -->
        <var-decl name='__kind' type-id='type-id-5' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='32' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='160'>
        <!-- short int __pthread_mutex_s::__spins -->
        <var-decl name='__spins' type-id='type-id-7' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='34' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='176'>
        <!-- short int __pthread_mutex_s::__elision -->
        <var-decl name='__elision' type-id='type-id-7' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='35' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- __pthread_list_t __pthread_mutex_s::__list -->
        <var-decl name='__list' type-id='type-id-36' visibility='default' filepath='/usr/include/bits/struct_mutex.h' line='36' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef __pthread_internal_list __pthread_list_t -->
    <typedef-decl name='__pthread_list_t' type-id='type-id-37' filepath='/usr/include/bits/thread-shared-types.h' line='53' column='1' id='type-id-36'/>
    <!-- struct __pthread_internal_list -->
    <class-decl name='__pthread_internal_list' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='49' column='1' id='type-id-37'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- __pthread_internal_list* __pthread_internal_list::__prev -->
        <var-decl name='__prev' type-id='type-id-38' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='51' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- __pthread_internal_list* __pthread_internal_list::__next -->
        <var-decl name='__next' type-id='type-id-38' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='52' column='1'/>
      </data-member>
    </class-decl>
    <!-- __pthread_internal_list* -->
    <pointer-type-def type-id='type-id-37' size-in-bits='64' id='type-id-38'/>
    <!-- call_rcu_data* -->
    <pointer-type-def type-id='type-id-30' size-in-bits='64' id='type-id-39'/>
    <!-- cds_list_head* -->
    <pointer-type-def type-id='type-id-14' size-in-bits='64' id='type-id-16'/>
    <!-- cds_wfcq_node* -->
    <pointer-type-def type-id='type-id-24' size-in-bits='64' id='type-id-26'/>
    <!-- const rcu_flavor_struct -->
    <qualified-type-def type-id='type-id-17' const='yes' id='type-id-40'/>
    <!-- int ()* -->
    <pointer-type-def type-id='type-id-41' size-in-bits='64' id='type-id-19'/>
    <!-- rcu_head* -->
    <pointer-type-def type-id='type-id-23' size-in-bits='64' id='type-id-42'/>
    <!-- urcu_atfork* -->
    <pointer-type-def type-id='type-id-27' size-in-bits='64' id='type-id-43'/>
    <!-- void ()* -->
    <pointer-type-def type-id='type-id-44' size-in-bits='64' id='type-id-18'/>
    <!-- void (rcu_head*)* -->
    <pointer-type-def type-id='type-id-45' size-in-bits='64' id='type-id-25'/>
    <!-- void (rcu_head*, void (rcu_head*)*)* -->
    <pointer-type-def type-id='type-id-46' size-in-bits='64' id='type-id-20'/>
    <!-- void (urcu_atfork*)* -->
    <pointer-type-def type-id='type-id-47' size-in-bits='64' id='type-id-22'/>
    <!-- void (void (void*)*, void*)* -->
    <pointer-type-def type-id='type-id-48' size-in-bits='64' id='type-id-21'/>
    <!-- void (void*)* -->
    <pointer-type-def type-id='type-id-49' size-in-bits='64' id='type-id-28'/>
    <!-- void* -->
    <pointer-type-def type-id='type-id-9' size-in-bits='64' id='type-id-29'/>
    <!-- urcu_gp urcu_qsbr_gp -->
    <var-decl name='urcu_qsbr_gp' type-id='type-id-10' mangled-name='rcu_gp_qsbr' visibility='default' filepath='../include/urcu/static/urcu-qsbr.h' line='63' column='1' elf-symbol-id='rcu_gp_qsbr'/>
    <!-- urcu_qsbr_reader urcu_qsbr_reader -->
    <var-decl name='urcu_qsbr_reader' type-id='type-id-13' mangled-name='urcu_qsbr_reader' visibility='default' filepath='../include/urcu/static/urcu-qsbr.h' line='76' column='1' elf-symbol-id='urcu_qsbr_reader'/>
    <!-- const rcu_flavor_struct urcu_qsbr_flavor -->
    <var-decl name='urcu_qsbr_flavor' type-id='type-id-40' mangled-name='urcu_qsbr_flavor' visibility='default' filepath='../include/urcu/flavor.h' line='90' column='1' elf-symbol-id='urcu_qsbr_flavor'/>
    <!-- void urcu_qsbr_defer_exit() -->
    <function-decl name='urcu_qsbr_defer_exit' mangled-name='urcu_qsbr_defer_exit' filepath='src/urcu-defer-impl.h' line='476' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='urcu_qsbr_defer_exit'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void urcu_qsbr_defer_unregister_thread() -->
    <function-decl name='urcu_qsbr_defer_unregister_thread' mangled-name='urcu_qsbr_defer_unregister_thread' filepath='src/urcu-defer-impl.h' line='456' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='urcu_qsbr_defer_unregister_thread'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- int urcu_qsbr_defer_register_thread() -->
    <function-decl name='urcu_qsbr_defer_register_thread' mangled-name='urcu_qsbr_defer_register_thread' filepath='src/urcu-defer-impl.h' line='432' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='urcu_qsbr_defer_register_thread'>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- void urcu_qsbr_defer_rcu(void (void*)*, void*) -->
    <function-decl name='urcu_qsbr_defer_rcu' mangled-name='defer_rcu_qsbr' filepath='src/urcu-defer-impl.h' line='400' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='defer_rcu_qsbr'>
      <!-- parameter of type 'void (void*)*' -->
      <parameter type-id='type-id-28' name='fct' filepath='src/urcu-defer-impl.h' line='400' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-29' name='p' filepath='src/urcu-defer-impl.h' line='400' column='1'/>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void urcu_qsbr_defer_barrier() -->
    <function-decl name='urcu_qsbr_defer_barrier' mangled-name='rcu_defer_barrier_qsbr' filepath='src/urcu-defer-impl.h' line='284' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_defer_barrier_qsbr'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void urcu_qsbr_defer_barrier_thread() -->
    <function-decl name='urcu_qsbr_defer_barrier_thread' mangled-name='rcu_defer_barrier_thread_qsbr' filepath='src/urcu-defer-impl.h' line='262' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_defer_barrier_thread_qsbr'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void urcu_qsbr_unregister_rculfhash_atfork(urcu_atfork*) -->
    <function-decl name='urcu_qsbr_unregister_rculfhash_atfork' mangled-name='urcu_unregister_rculfhash_atfork_qsbr' filepath='src/urcu-call-rcu-impl.h' line='1056' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='urcu_unregister_rculfhash_atfork_qsbr'>
      <!-- parameter of type 'urcu_atfork*' -->
      <parameter type-id='type-id-43' name='atfork' filepath='src/urcu-call-rcu-impl.h' line='1056' column='1'/>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void urcu_qsbr_register_rculfhash_atfork(urcu_atfork*) -->
    <function-decl name='urcu_qsbr_register_rculfhash_atfork' mangled-name='urcu_register_rculfhash_atfork_qsbr' filepath='src/urcu-call-rcu-impl.h' line='1044' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='urcu_register_rculfhash_atfork_qsbr'>
      <!-- parameter of type 'urcu_atfork*' -->
      <parameter type-id='type-id-43' name='atfork' filepath='src/urcu-call-rcu-impl.h' line='1044' column='1'/>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void urcu_qsbr_call_rcu_after_fork_child() -->
    <function-decl name='urcu_qsbr_call_rcu_after_fork_child' mangled-name='call_rcu_after_fork_child_qsbr' filepath='src/urcu-call-rcu-impl.h' line='1000' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='call_rcu_after_fork_child_qsbr'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void urcu_qsbr_call_rcu_after_fork_parent() -->
    <function-decl name='urcu_qsbr_call_rcu_after_fork_parent' mangled-name='urcu_qsbr_call_rcu_after_fork_parent' filepath='src/urcu-call-rcu-impl.h' line='976' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='urcu_qsbr_call_rcu_after_fork_parent'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void urcu_qsbr_call_rcu_before_fork() -->
    <function-decl name='urcu_qsbr_call_rcu_before_fork' mangled-name='call_rcu_before_fork_qsbr' filepath='src/urcu-call-rcu-impl.h' line='947' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='call_rcu_before_fork_qsbr'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void urcu_qsbr_barrier() -->
    <function-decl name='urcu_qsbr_barrier' mangled-name='urcu_qsbr_barrier' filepath='src/urcu-call-rcu-impl.h' line='874' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='urcu_qsbr_barrier'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void urcu_qsbr_free_all_cpu_call_rcu_data() -->
    <function-decl name='urcu_qsbr_free_all_cpu_call_rcu_data' mangled-name='free_all_cpu_call_rcu_data' filepath='src/urcu-call-rcu-impl.h' line='801' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='free_all_cpu_call_rcu_data'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void urcu_qsbr_call_rcu_data_free(call_rcu_data*) -->
    <function-decl name='urcu_qsbr_call_rcu_data_free' mangled-name='urcu_qsbr_call_rcu_data_free' filepath='src/urcu-call-rcu-impl.h' line='764' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='urcu_qsbr_call_rcu_data_free'>
      <!-- parameter of type 'call_rcu_data*' -->
      <parameter type-id='type-id-39' name='crdp' filepath='src/urcu-call-rcu-impl.h' line='764' column='1'/>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void urcu_qsbr_call_rcu(rcu_head*, void (rcu_head*)*) -->
    <function-decl name='urcu_qsbr_call_rcu' mangled-name='urcu_qsbr_call_rcu' filepath='src/urcu-call-rcu-impl.h' line='725' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='urcu_qsbr_call_rcu'>
      <!-- parameter of type 'rcu_head*' -->
      <parameter type-id='type-id-42' name='head' filepath='src/urcu-call-rcu-impl.h' line='725' column='1'/>
      <!-- parameter of type 'void (rcu_head*)*' -->
      <parameter type-id='type-id-25' name='func' filepath='src/urcu-call-rcu-impl.h' line='726' column='1'/>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- int urcu_qsbr_create_all_cpu_call_rcu_data(unsigned long int) -->
    <function-decl name='urcu_qsbr_create_all_cpu_call_rcu_data' mangled-name='urcu_qsbr_create_all_cpu_call_rcu_data' filepath='src/urcu-call-rcu-impl.h' line='645' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='urcu_qsbr_create_all_cpu_call_rcu_data'>
      <!-- parameter of type 'unsigned long int' -->
      <parameter type-id='type-id-3' name='flags' filepath='src/urcu-call-rcu-impl.h' line='645' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- void urcu_qsbr_set_thread_call_rcu_data(call_rcu_data*) -->
    <function-decl name='urcu_qsbr_set_thread_call_rcu_data' mangled-name='set_thread_call_rcu_data_qsbr' filepath='src/urcu-call-rcu-impl.h' line='630' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='set_thread_call_rcu_data_qsbr'>
      <!-- parameter of type 'call_rcu_data*' -->
      <parameter type-id='type-id-39' name='crdp' filepath='src/urcu-call-rcu-impl.h' line='630' column='1'/>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- call_rcu_data* urcu_qsbr_get_thread_call_rcu_data() -->
    <function-decl name='urcu_qsbr_get_thread_call_rcu_data' mangled-name='urcu_qsbr_get_thread_call_rcu_data' filepath='src/urcu-call-rcu-impl.h' line='612' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='urcu_qsbr_get_thread_call_rcu_data'>
      <!-- call_rcu_data* -->
      <return type-id='type-id-39'/>
    </function-decl>
    <!-- call_rcu_data* urcu_qsbr_get_call_rcu_data() -->
    <function-decl name='urcu_qsbr_get_call_rcu_data' mangled-name='get_call_rcu_data_qsbr' filepath='src/urcu-call-rcu-impl.h' line='590' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_call_rcu_data_qsbr'>
      <!-- call_rcu_data* -->
      <return type-id='type-id-39'/>
    </function-decl>
    <!-- call_rcu_data* urcu_qsbr_get_default_call_rcu_data() -->
    <function-decl name='urcu_qsbr_get_default_call_rcu_data' mangled-name='urcu_qsbr_get_default_call_rcu_data' filepath='src/urcu-call-rcu-impl.h' line='563' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='urcu_qsbr_get_default_call_rcu_data'>
      <!-- call_rcu_data* -->
      <return type-id='type-id-39'/>
    </function-decl>
    <!-- int urcu_qsbr_set_cpu_call_rcu_data(int, call_rcu_data*) -->
    <function-decl name='urcu_qsbr_set_cpu_call_rcu_data' mangled-name='set_cpu_call_rcu_data_qsbr' filepath='src/urcu-call-rcu-impl.h' line='522' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='set_cpu_call_rcu_data_qsbr'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='cpu' filepath='src/urcu-call-rcu-impl.h' line='522' column='1'/>
      <!-- parameter of type 'call_rcu_data*' -->
      <parameter type-id='type-id-39' name='crdp' filepath='src/urcu-call-rcu-impl.h' line='522' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- call_rcu_data* urcu_qsbr_create_call_rcu_data(unsigned long int, int) -->
    <function-decl name='urcu_qsbr_create_call_rcu_data' mangled-name='urcu_qsbr_create_call_rcu_data' filepath='src/urcu-call-rcu-impl.h' line='498' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='urcu_qsbr_create_call_rcu_data'>
      <!-- parameter of type 'unsigned long int' -->
      <parameter type-id='type-id-3' name='flags' filepath='src/urcu-call-rcu-impl.h' line='498' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='cpu_affinity' filepath='src/urcu-call-rcu-impl.h' line='499' column='1'/>
      <!-- call_rcu_data* -->
      <return type-id='type-id-39'/>
    </function-decl>
    <!-- pthread_t urcu_qsbr_get_call_rcu_thread(call_rcu_data*) -->
    <function-decl name='urcu_qsbr_get_call_rcu_thread' mangled-name='urcu_qsbr_get_call_rcu_thread' filepath='src/urcu-call-rcu-impl.h' line='476' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='urcu_qsbr_get_call_rcu_thread'>
      <!-- parameter of type 'call_rcu_data*' -->
      <parameter type-id='type-id-39' name='crdp' filepath='src/urcu-call-rcu-impl.h' line='476' column='1'/>
      <!-- typedef pthread_t -->
      <return type-id='type-id-15'/>
    </function-decl>
    <!-- call_rcu_data* urcu_qsbr_get_cpu_call_rcu_data(int) -->
    <function-decl name='urcu_qsbr_get_cpu_call_rcu_data' mangled-name='get_cpu_call_rcu_data_qsbr' filepath='src/urcu-call-rcu-impl.h' line='452' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='get_cpu_call_rcu_data_qsbr'>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='cpu' filepath='src/urcu-call-rcu-impl.h' line='452' column='1'/>
      <!-- call_rcu_data* -->
      <return type-id='type-id-39'/>
    </function-decl>
    <!-- void urcu_qsbr_exit() -->
    <function-decl name='urcu_qsbr_exit' mangled-name='urcu_qsbr_exit' filepath='src/urcu-qsbr.c' line='512' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='urcu_qsbr_exit'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void urcu_qsbr_unregister_thread() -->
    <function-decl name='urcu_qsbr_unregister_thread' mangled-name='urcu_qsbr_unregister_thread' filepath='src/urcu-qsbr.c' line='496' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='urcu_qsbr_unregister_thread'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void urcu_qsbr_register_thread() -->
    <function-decl name='urcu_qsbr_register_thread' mangled-name='urcu_qsbr_register_thread' filepath='src/urcu-qsbr.c' line='481' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='urcu_qsbr_register_thread'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void urcu_qsbr_thread_online() -->
    <function-decl name='urcu_qsbr_thread_online' mangled-name='urcu_qsbr_thread_online' filepath='src/urcu-qsbr.c' line='474' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='urcu_qsbr_thread_online'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void urcu_qsbr_thread_offline() -->
    <function-decl name='urcu_qsbr_thread_offline' mangled-name='urcu_qsbr_thread_offline' filepath='src/urcu-qsbr.c' line='467' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='urcu_qsbr_thread_offline'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void urcu_qsbr_quiescent_state() -->
    <function-decl name='urcu_qsbr_quiescent_state' mangled-name='urcu_qsbr_quiescent_state' filepath='src/urcu-qsbr.c' line='460' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='urcu_qsbr_quiescent_state'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- int urcu_qsbr_read_ongoing() -->
    <function-decl name='urcu_qsbr_read_ongoing' mangled-name='rcu_read_ongoing_qsbr' filepath='src/urcu-qsbr.c' line='453' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_read_ongoing_qsbr'>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- void urcu_qsbr_read_unlock() -->
    <function-decl name='urcu_qsbr_read_unlock' mangled-name='urcu_qsbr_read_unlock' filepath='src/urcu-qsbr.c' line='447' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='urcu_qsbr_read_unlock'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void urcu_qsbr_read_lock() -->
    <function-decl name='urcu_qsbr_read_lock' mangled-name='rcu_read_lock_qsbr' filepath='src/urcu-qsbr.c' line='441' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_read_lock_qsbr'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- void urcu_qsbr_synchronize_rcu() -->
    <function-decl name='urcu_qsbr_synchronize_rcu' mangled-name='urcu_qsbr_synchronize_rcu' filepath='src/urcu-qsbr.c' line='349' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='urcu_qsbr_synchronize_rcu'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-decl>
    <!-- int () -->
    <function-type size-in-bits='64' id='type-id-41'>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-type>
    <!-- void () -->
    <function-type size-in-bits='64' id='type-id-44'>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-type>
    <!-- void (rcu_head*) -->
    <function-type size-in-bits='64' id='type-id-45'>
      <!-- parameter of type 'rcu_head*' -->
      <parameter type-id='type-id-42'/>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-type>
    <!-- void (rcu_head*, void (rcu_head*)*) -->
    <function-type size-in-bits='64' id='type-id-46'>
      <!-- parameter of type 'rcu_head*' -->
      <parameter type-id='type-id-42'/>
      <!-- parameter of type 'void (rcu_head*)*' -->
      <parameter type-id='type-id-25'/>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-type>
    <!-- void (urcu_atfork*) -->
    <function-type size-in-bits='64' id='type-id-47'>
      <!-- parameter of type 'urcu_atfork*' -->
      <parameter type-id='type-id-43'/>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-type>
    <!-- void (void (void*)*, void*) -->
    <function-type size-in-bits='64' id='type-id-48'>
      <!-- parameter of type 'void (void*)*' -->
      <parameter type-id='type-id-28'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-29'/>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-type>
    <!-- void (void*) -->
    <function-type size-in-bits='64' id='type-id-49'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-29'/>
      <!-- void -->
      <return type-id='type-id-9'/>
    </function-type>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='urcu-pointer.c' comp-dir-path='src' language='LANG_C99'>
    <!-- void** -->
    <pointer-type-def type-id='type-id-29' size-in-bits='64' id='type-id-50'/>
    <!-- void* rcu_cmpxchg_pointer_sym(void**, void*, void*) -->
    <function-decl name='rcu_cmpxchg_pointer_sym' mangled-name='rcu_cmpxchg_pointer_sym' filepath='src/urcu-pointer.c' line='53' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_cmpxchg_pointer_sym'>
      <!-- parameter of type 'void**' -->
      <parameter type-id='type-id-50' name='p' filepath='src/urcu-pointer.c' line='53' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-29' name='old' filepath='src/urcu-pointer.c' line='53' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-29' name='_new' filepath='src/urcu-pointer.c' line='53' column='1'/>
      <!-- void* -->
      <return type-id='type-id-29'/>
    </function-decl>
    <!-- void* rcu_xchg_pointer_sym(void**, void*) -->
    <function-decl name='rcu_xchg_pointer_sym' mangled-name='rcu_xchg_pointer_sym' filepath='src/urcu-pointer.c' line='47' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_xchg_pointer_sym'>
      <!-- parameter of type 'void**' -->
      <parameter type-id='type-id-50' name='p' filepath='src/urcu-pointer.c' line='47' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-29' name='v' filepath='src/urcu-pointer.c' line='47' column='1'/>
      <!-- void* -->
      <return type-id='type-id-29'/>
    </function-decl>
    <!-- void* rcu_set_pointer_sym(void**, void*) -->
    <function-decl name='rcu_set_pointer_sym' mangled-name='rcu_set_pointer_sym' filepath='src/urcu-pointer.c' line='40' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_set_pointer_sym'>
      <!-- parameter of type 'void**' -->
      <parameter type-id='type-id-50' name='p' filepath='src/urcu-pointer.c' line='40' column='1'/>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-29' name='v' filepath='src/urcu-pointer.c' line='40' column='1'/>
      <!-- void* -->
      <return type-id='type-id-29'/>
    </function-decl>
    <!-- void* rcu_dereference_sym(void*) -->
    <function-decl name='rcu_dereference_sym' mangled-name='rcu_dereference_sym' filepath='src/urcu-pointer.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='rcu_dereference_sym'>
      <!-- parameter of type 'void*' -->
      <parameter type-id='type-id-29' name='p' filepath='src/urcu-pointer.c' line='35' column='1'/>
      <!-- void* -->
      <return type-id='type-id-29'/>
    </function-decl>
  </abi-instr>
  <abi-instr version='1.0' address-size='64' path='compat_futex.c' comp-dir-path='src' language='LANG_C99'>


    <!-- char[48] -->
    <array-type-def dimensions='1' type-id='type-id-1' size-in-bits='384' id='type-id-51'>
      <!-- <anonymous range>[48] -->
      <subrange length='48' type-id='type-id-3' id='type-id-52'/>

    </array-type-def>
    <!-- long long int -->
    <type-decl name='long long int' size-in-bits='64' id='type-id-53'/>
    <!-- long long unsigned int -->
    <type-decl name='long long unsigned int' size-in-bits='64' id='type-id-54'/>
    <!-- unsigned int[2] -->
    <array-type-def dimensions='1' type-id='type-id-8' size-in-bits='64' id='type-id-55'>
      <!-- <anonymous range>[2] -->
      <subrange length='2' type-id='type-id-3' id='type-id-56'/>

    </array-type-def>
    <!-- typedef __anonymous_union__ pthread_cond_t -->
    <typedef-decl name='pthread_cond_t' type-id='type-id-57' filepath='/usr/include/bits/pthreadtypes.h' line='80' column='1' id='type-id-58'/>
    <!-- union {__pthread_cond_s __data; char __size[48]; long long int __align;} -->
    <union-decl name='__anonymous_union__' size-in-bits='384' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='75' column='1' id='type-id-57'>
      <data-member access='private'>
        <!-- __pthread_cond_s __data -->
        <var-decl name='__data' type-id='type-id-59' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='77' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- char __size[48] -->
        <var-decl name='__size' type-id='type-id-51' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='78' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- long long int __align -->
        <var-decl name='__align' type-id='type-id-53' visibility='default' filepath='/usr/include/bits/pthreadtypes.h' line='79' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct __pthread_cond_s -->
    <class-decl name='__pthread_cond_s' size-in-bits='384' is-struct='yes' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='92' column='1' id='type-id-59'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- union {long long unsigned int __wseq; struct {unsigned int __low; unsigned int __high;} __wseq32;} -->
        <var-decl name='' type-id='type-id-60' visibility='default'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='128'>
        <!-- unsigned int __pthread_cond_s::__g_refs[2] -->
        <var-decl name='__g_refs' type-id='type-id-55' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='112' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='192'>
        <!-- unsigned int __pthread_cond_s::__g_size[2] -->
        <var-decl name='__g_size' type-id='type-id-55' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='113' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='256'>
        <!-- unsigned int __pthread_cond_s::__g1_orig_size -->
        <var-decl name='__g1_orig_size' type-id='type-id-8' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='114' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='288'>
        <!-- unsigned int __pthread_cond_s::__wrefs -->
        <var-decl name='__wrefs' type-id='type-id-8' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='115' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='320'>
        <!-- unsigned int __pthread_cond_s::__g_signals[2] -->
        <var-decl name='__g_signals' type-id='type-id-55' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='116' column='1'/>
      </data-member>
    </class-decl>
    <!-- union {long long unsigned int __wseq; struct {unsigned int __low; unsigned int __high;} __wseq32;} -->
    <union-decl name='__anonymous_union__1' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='94' column='1' id='type-id-60'>
      <data-member access='private'>
        <!-- long long unsigned int __wseq -->
        <var-decl name='__wseq' type-id='type-id-54' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='96' column='1'/>
      </data-member>
      <data-member access='private'>
        <!-- struct {unsigned int __low; unsigned int __high;} __wseq32 -->
        <var-decl name='__wseq32' type-id='type-id-61' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='101' column='1'/>
      </data-member>
    </union-decl>
    <!-- struct {unsigned int __low; unsigned int __high;} -->
    <class-decl name='__anonymous_struct__' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='97' column='1' id='type-id-61'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- unsigned int __low -->
        <var-decl name='__low' type-id='type-id-8' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='99' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='32'>
        <!-- unsigned int __high -->
        <var-decl name='__high' type-id='type-id-8' visibility='default' filepath='/usr/include/bits/thread-shared-types.h' line='100' column='1'/>
      </data-member>
    </class-decl>
    <!-- struct timespec -->
    <class-decl name='timespec' size-in-bits='128' is-struct='yes' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='10' column='1' id='type-id-62'>
      <data-member access='public' layout-offset-in-bits='0'>
        <!-- __time_t timespec::tv_sec -->
        <var-decl name='tv_sec' type-id='type-id-63' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='12' column='1'/>
      </data-member>
      <data-member access='public' layout-offset-in-bits='64'>
        <!-- __syscall_slong_t timespec::tv_nsec -->
        <var-decl name='tv_nsec' type-id='type-id-64' visibility='default' filepath='/usr/include/bits/types/struct_timespec.h' line='16' column='1'/>
      </data-member>
    </class-decl>
    <!-- typedef long int __time_t -->
    <typedef-decl name='__time_t' type-id='type-id-6' filepath='/usr/include/bits/types.h' line='160' column='1' id='type-id-63'/>
    <!-- typedef long int __syscall_slong_t -->
    <typedef-decl name='__syscall_slong_t' type-id='type-id-6' filepath='/usr/include/bits/types.h' line='197' column='1' id='type-id-64'/>
    <!-- const timespec -->
    <qualified-type-def type-id='type-id-62' const='yes' id='type-id-65'/>
    <!-- const timespec* -->
    <pointer-type-def type-id='type-id-65' size-in-bits='64' id='type-id-66'/>
    <!-- int32_t* -->
    <pointer-type-def type-id='type-id-11' size-in-bits='64' id='type-id-67'/>
    <!-- pthread_mutex_t __urcu_compat_futex_lock -->
    <var-decl name='__urcu_compat_futex_lock' type-id='type-id-33' mangled-name='__urcu_compat_futex_lock' visibility='default' filepath='src/compat_futex.c' line='44' column='1' elf-symbol-id='__urcu_compat_futex_lock'/>
    <!-- pthread_cond_t __urcu_compat_futex_cond -->
    <var-decl name='__urcu_compat_futex_cond' type-id='type-id-58' mangled-name='__urcu_compat_futex_cond' visibility='default' filepath='src/compat_futex.c' line='46' column='1' elf-symbol-id='__urcu_compat_futex_cond'/>
    <!-- int compat_futex_async(int32_t*, int, int32_t, const timespec*, int32_t*, int32_t) -->
    <function-decl name='compat_futex_async' mangled-name='compat_futex_async' filepath='src/compat_futex.c' line='118' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='compat_futex_async'>
      <!-- parameter of type 'int32_t*' -->
      <parameter type-id='type-id-67' name='uaddr' filepath='src/compat_futex.c' line='118' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='op' filepath='src/compat_futex.c' line='118' column='1'/>
      <!-- parameter of type 'typedef int32_t' -->
      <parameter type-id='type-id-11' name='val' filepath='src/compat_futex.c' line='118' column='1'/>
      <!-- parameter of type 'const timespec*' -->
      <parameter type-id='type-id-66' name='timeout' filepath='src/compat_futex.c' line='119' column='1'/>
      <!-- parameter of type 'int32_t*' -->
      <parameter type-id='type-id-67' name='uaddr2' filepath='src/compat_futex.c' line='119' column='1'/>
      <!-- parameter of type 'typedef int32_t' -->
      <parameter type-id='type-id-11' name='val3' filepath='src/compat_futex.c' line='119' column='1'/>
      <!-- int -->
      <return type-id='type-id-5'/>
    </function-decl>
    <!-- int compat_futex_noasync(int32_t*, int, int32_t, const timespec*, int32_t*, int32_t) -->
    <function-decl name='compat_futex_noasync' mangled-name='compat_futex_noasync' filepath='src/compat_futex.c' line='54' column='1' visibility='default' binding='global' size-in-bits='64' elf-symbol-id='compat_futex_noasync'>
      <!-- parameter of type 'int32_t*' -->
      <parameter type-id='type-id-67' name='uaddr' filepath='src/compat_futex.c' line='54' column='1'/>
      <!-- parameter of type 'int' -->
      <parameter type-id='type-id-5' name='op' filepath='src/compat_futex.c' line='54' column='1'/>
      <!-- parameter of type 'typedef int32_t' -->
      <parameter type-id='type-id-11' name='val' filepath='src/compat_futex.c' line='54' column='1'/>
      <!-- parameter of type 'const timespec*' -->
      <parameter type-id='type-id-66' name='timeout' filepath='src/compat_futex.c' line='55' column='1'/>
      <!-- parameter of type 'int32_t*' -->
      <parameter type-id='type-id-67' name='uaddr2' filepath='src/compat_futex.c' line='55' column='1'/>
      <!-- parameter of type 'typedef int32_t' -->
